##################################################
##
## Constraint file for Synplify Pro
##   Generated by FICE(mksdc) ver 1.1.246
##   time : Tue Jan 25 12:58:34 +0900 2011
##
##################################################

####  Use Following File(s) ####
# _device_scr/d78f1070_chip.scr_101019
# _device_scr/d78f1070_clock.scr_32MHz_30ns
# _device_scr/d78f1070_mode.scr_100920

#
#  Constraint for ICE Macro
#

#
# CLOCK Attribute
#
# ice system
define_clock { n:CLK30MHZ_GB } -name { CLK30MHZ_GB } -freq 30.000 -clockgroup clk30mhzgb -route 0.000
# ice system(dcm)
define_clock { n:CLK60MHZ } -name { CLK60MHZ } -freq 60.000 -clockgroup clk60mhz -route 0.000
# usb
define_clock { n:USBCLK } -name { USBCLK } -freq 20.000 -clockgroup usb -route 0.000
# host interface
define_clock { n:ice.ICEWR } -name { ICEWR } -freq 2.000 -clockgroup icewr -route 0.000
# pseudo-emulation
define_clock { n:USBIFWR } -name { USBIFWR } -freq 2.000 -clockgroup usbifwr -route 0.000
define_clock { n:ice.timetagv2.CLK240M } -name { CLK240M } -freq 240 -clockgroup clk240m -route 0
define_clock { n:chiptop.h_rosc.CLK160M } -name { CLK160M } -freq 160 -clockgroup clk160m -route 0
# for internal clock
define_clock   { n:RESB } -name { RESB }  -freq 2 -clockgroup RESB -route 0;

#
# LOGIC Attribute
#
define_false_path -to { i:ice.host_interface.usb2usbif.hi_read_data* }
define_false_path -to { i:ice.host_interface.usbif2ice.iceifa* }
define_false_path -to { i:ice.host_interface.usbif2ice.iceifaclk_d2 }
define_false_path -from { i:ice.host_interface.VDDLEV* }
define_false_path -to { i:ice.host_interface.snatch.en_snatch }
define_false_path -through { n:ice.host_interface.snatch.ICEDO[31:0] } -through { n:ice.host_interface.snatch.MDR[15:0] }
define_false_path -to { i:ice.break.STBRELESV }
define_false_path -through { n:ice.ICERESB }
define_false_path -to { i:ice.emem.rom.clksel.low1_p }
define_false_path -to { i:ice.emem.rom.clksel.clksel_resetb_p }
define_false_path -to { i:ice.emem.rom.clksel.clksel_p }
define_attribute { USBCLK } { syn_noclockbuf } { 1 }
define_attribute { n:ice.ICEWR } { syn_noclockbuf } { 1 }
define_attribute { n:RESB } { syn_noclockbuf } { 1 }
define_attribute { i:ice.trace.trdata.pcwaitf_l } { syn_noclockbuf } { 1 }
# flash_cp
define_false_path -from { i:chiptop.chip.flash_cp.*.*.* }
define_false_path -from { i:chiptop.chip.flash_cp.*.*.*.* }
define_false_path -to { i:chiptop.chip.flash_cp.*.*.* }
define_false_path -to { i:chiptop.chip.flash_cp.*.*.*.* }
# timetag
define_max_delay -from { i:ice.timetagv2.tag[31:0] } -to { i:ice.trace.trdata.fch_data_l2[31:0] } { 3 }
define_max_delay -from { i:ice.timetagv2.TAGOVF } -to { i:ice.trace.trdata.tagovf_l1 } { 3 }

#
# GROBAL
#
define_global_attribute  { syn_forward_io_constraints } { 0 }
define_global_attribute  { xc_use_timespec_for_io } { 0 }
define_global_attribute  { syn_useioff } { 1 }
define_global_attribute  { xc_fast_auto } { 1 }

#
# Special Constraint about dummy-path at Device Logic
#

#
# Special Constraint about dummy-path at Device Logid add on Oct 15,2010
#
# <<<Hold issue>>>
define_false_path -to { i:ice.status.cpumclkst.clkm_p1 }
define_false_path -to { i:ice.timetagv2.sampbck }

# <<<tune the hi-level latch's effective timing>>>
define_max_delay -from { c:FCLK } -through { n:chiptop.chip.CK0IIC0 } -to { i:chiptop.chip.iica.micg_gate_0.U1.DLSFQ2_inst.LDCPE_inst } { 31.25 }
define_max_delay -from { c:FCLK } -through { n:chiptop.chip.porga.main.regctl.pclkrw_latch.G001 } -to { i:chiptop.chip.porga.main.regctl.pclkrw_latch.DLSFQ2_inst.LDCPE_inst } { 31.25 }

#define_path_delay  -through {n:chiptop.chip.modectl.modectl_usertop.modectl_incdec.crc0_gate.G001}  -to {{i:chiptop.chip.modectl.modectl_usertop.modectl_incdec.crc0_gate.DLSFQ2_inst.LDCPE_inst}}  -max 29
# Cut pseudo path (crc0_gate.G001 propagate to latch's din-pin and clock-pin.)
#define_false_path -through {n:chiptop.chip.modectl.modectl_usertop.modectl_incdec.crc0_gate.G001} -through {n:chiptop.chip.csc.cg.tbase.fclk_cts.clkout} -to {i:chiptop.chip.modectl.modectl_usertop.modectl_incdec.crc0_gate.DLSFQ2_inst.LDCPE_inst}
#define_false_path -from {i:chiptop.chip.modectl.modectl_usertop.modectl_incdec.usrcrcctl.crcctl[6]} -through {n:chiptop.chip.csc.cg.tbase.fclk_cts.clkout} -to {i:chiptop.chip.modectl.modectl_usertop.modectl_incdec.crc0_gate.DLSFQ2_inst.LDCPE_inst}

define_max_delay -from { c:FCLK } -through { n:chiptop.chip.cibc.nvmchk.baseck_latch.G001 } -to { i:chiptop.chip.cibc.nvmchk.baseck_latch.DLSFQ2_inst.LDCPE_inst } { 31.25 }
define_max_delay -from { c:FCLK } -through { n:chiptop.chip.cibc.fmop.frqdec.we_frqsel } -to { i:chiptop.chip.cibc.fmop.frqdec.frqselck_latch.DLSFQ2_inst.LDCPE_inst } { 31.25 }
define_max_delay -from { c:FCLK } -through { n:chiptop.chip.cibc.fmop.b_trmlv2_iref_en } -to { i:chiptop.chip.cibc.fmop.main.trmlv.irefck_latch.DLSFQ2_inst.LDCPE_inst } { 31.25 }
define_max_delay -from { c:FCLK } -through { n:chiptop.chip.cibc.fmop.b_trmlv2_vreadC_en } -to { i:chiptop.chip.cibc.fmop.main.trmlv.vreadCck_latch.DLSFQ2_inst.LDCPE_inst } { 31.25 }
define_max_delay -from { c:FCLK } -through { n:chiptop.chip.cibc.fmop.main.baseck_latch.G001 } -to { i:chiptop.chip.cibc.fmop.main.baseck_latch.DLSFQ2_inst.LDCPE_inst } { 31.25 }
define_max_delay -from { c:FCLK } -through { n:chiptop.chip.OPBOEN } -to { i:chiptop.chip.csc.rg.lvictl.main.lvimd_gate.DLSFQ2_inst.LDCPE_inst } { 31.25 }

# <<<32MHz issue>>>
#define_false_path -from {i:chiptop.chip.cpu.alu.Z i:chiptop.chip.cpu.alu.CY i:chiptop.chip.cpu.alu.RBS[1] i:chiptop.chip.cpu.alu.RBS[0]} -to {i:chiptop.chip.csc.cg.tbase.stby.stpst_neg}

define_false_path -from { i:chiptop.chip.cpu.alu.* } -to { i:chiptop.chip.csc.cg.tbase.stby.stpst_neg }
define_false_path -through { n:chiptop.chip.cpu.adr.slmirr } -to { i:chiptop.chip.csc.cg.tbase.stby.stpst_neg }
define_false_path -from { i:chiptop.chip.cpu.adr.pa_data_maw i:chiptop.chip.cpu.adr.pa_data_buf i:chiptop.chip.cpu.adr.pa_data_mlt1 i:chiptop.chip.cpu.adr.pa_data_cyc1 } -to { i:chiptop.chip.csc.cg.tbase.stby.stpst_neg }
define_false_path -through { n:chiptop.chip.cpu.alu.SP_usr[*] n:chiptop.chip.cpu.alu.SP_sv[*] } -to { i:chiptop.chip.csc.cg.tbase.stby.stpst_neg }
define_false_path -through { n:chiptop.chip.cpu.adr.maw[*] } -to { i:chiptop.chip.csc.cg.tbase.stby.stpst_neg }

# <<<ICE WakeUp issue>>>
#define_path_delay  -through {n:chiptop.chip.cibc.fmop.main.trmlv.bgrt_clk.bgrt_en}  -to {{i:chiptop.chip.cibc.fmop.main.trmlv.bgrt_latch.bgrt_0.ft3_latch1.DLSFQ2_inst.LDCPE_inst}}  -max 10
#define_path_delay  -through {n:chiptop.chip.cibc.fmop.main.trmlv.bgrtc_clk.bgrt_en}  -to {{i:chiptop.chip.cibc.fmop.main.trmlv.bgrtc_latch.bgrtc_0.ft3_latch1.DLSFQ2_inst.LDCPE_inst}}  -max 10

define_attribute { n:chiptop.chip.cibc.fmop.main.trmlv.bgrt_clk.* } syn_noclockbuf { 1 };
define_attribute { n:chiptop.chip.cibc.fmop.main.trmlv.bgrtc_clk.* } syn_noclockbuf { 1 };

# <<<invalidate cibc circuit of decision by majority. (ICE Only)>>>
define_false_path -to { i:chiptop.chip.cibc.fmop.main.trmlv.bgrt_latch.bgrt_*.ft3_latch*.DLSFQ2_inst.LDCPE_inst }
define_false_path -to { i:chiptop.chip.cibc.fmop.main.trmlv.bgrtc_latch.bgrtc_*.ft3_latch*.DLSFQ2_inst.LDCPE_inst }
define_false_path -from { i:chiptop.chip.cibc.fmop.main.trmlv.bgrt_latch.bgrt_*.ft3_latch*.DLSFQ2_inst.LDCPE_inst }
define_false_path -from { i:chiptop.chip.cibc.fmop.main.trmlv.bgrtc_latch.bgrtc_*.ft3_latch*.DLSFQ2_inst.LDCPE_inst }

# add from 2010.12.06
define_false_path -from { i:chiptop.chip.csc.cg.hioscctl.fmain_sel.cksel_fih_p2.ckmsk2 }
define_false_path -from { i:chiptop.chip.csc.cg.hioscctl.fmain_sel.cksel_fmx.ckmsk2 }
define_false_path -from { i:chiptop.chip.csc.cg.hioscctl.fmain_sel.cksel_fmain_p.ckmsk2 }
define_false_path -from { i:chiptop.chip.csc.cg.hioscctl.fmain_sel.cksel_fmain_p.ckmsk1_p }
define_false_path -from { i:ice.emem.rom.icewr_start_latch }
define_false_path -from { i:ice.emem.rom.ice_write_latch }
# add from 2010.12.17 Redmine Ticket:#277
define_false_path -from { i:chiptop.chip.socket.cpu.adr.ID_stage* } -through { n:chiptop.chip.socket.cpu.adr.svmodf } -through { n:ice.break.SVI } -to { i:chiptop.chip.socket.csc.cg.tbase.stby.stpst_neg }
# add from 2010.12.24 Redmine Ticket #287 for Main/Sub OSC generating clock problem
define_compile_point { v:work.clockctl_cksel } -type { locked }
define_compile_point { v:work.QLK0RCSC1V2_CG_CKSEL1 } -type { locked }
define_compile_point { v:work.QLK0RCSC1V2_CG_CKSEL2 } -type { locked }

# FCLKとRESB間(FCLK Domain)のパスとしてSetupのCriticalに見えたのでfalseに指定。
define_false_path -from {c:FCLK} -to {i:chiptop.chip.int48.main.sfrreg.IFREGDBG.ed_reg}


# http://nqjpc147:1030/redmine/projects/k0r/wiki/200912_%EF%BC%86_V5_%E5%90%88%E6%88%90%E3%81%A7%E7%99%BA%E7%94%9F%E3%81%99%E3%82%8B%E3%82%BF%E3%82%A4%E3%83%9F%E3%83%B3%E3%82%B0%E3%82%A8%E3%83%A9%E3%83%BC%E3%82%92%E8%AA%BF%E6%9F%BB

# 1

define_clock {n:chiptop.chip.SCLI1DLY} -name {SCLI1DLY} -freq 10.000 -clockgroup SCLI1DLY -route 0.000
define_clock {n:chiptop.chip.SDAI1DLY} -name {SDAI1DLY} -freq 10.000 -clockgroup SDAI1DLY -route 0.000

define_false_path -from {c:FCLK} -to {c:SCLI1DLY c:SDAI1DLY};

# 2

define_multicycle_path -from {c:FCLK} -through { n:chiptop.chip.fcb.ONBD n:chiptop.chip.fcb.FLMEMTES n:chiptop.chip.fcb.ICENOECC n:chiptop.chip.fcb.ICEFLERR n:chiptop.chip.fcb.TFWEPR n:chiptop.chip.fcb.SCANMODE } -to {c:FCLK} { 2 }

# 3

define_false_path -from {i:ice.clockctl.sub_out_neg} -to { i:chiptop.chip.csc.cg.oscctl.root_oscouts.dly[0] i:ice.status.cpusclkst.clkm_p1};
define_false_path -from {i:ice.clockctl.evasclksel.clk1mk} -to { i:chiptop.chip.csc.cg.oscctl.root_oscouts.dly[0] i:ice.status.cpusclkst.clkm_p1};
define_false_path -from {i:ice.clockctl.sub_out_pos} -to { i:chiptop.chip.csc.cg.oscctl.root_oscouts.dly[0]};
define_false_path -from {i:ice.clockctl.mclk1sel.clk1mk} -to { i:ice.clockctl.mclk1sel.clk2mk };
define_false_path -from {i:ice.clockctl.mclk3sel.clk2mk} -to { i:ice.clockctl.mclk3sel.clk1mk };
define_false_path -from {i:ice.clockctl.mclk3sel.clk1mk} -to { i:ice.clockctl.mclk3sel.clk2mk };


# add from 2011.01.28

# Ignore the snatch path of host_interface both from hostaca*(@baseck) through mdr(@baseck) and iceifa(@icewr).
define_false_path -from { i:ice.host_interface.snatch.hostaca0* };
define_false_path -from { i:ice.host_interface.snatch.hostaca1* };

# Ignore the snatch path of host_interface both from hostacd*(@baseck) through icedi(@icewr).
define_false_path -from { i:ice.host_interface.snatch.hostacd0* };
define_false_path -from { i:ice.host_interface.snatch.hostacd1* };

# Ignore the snatch path of host_interface  both from en_snatch(@baseck) through mdr(@baseck) and iceifa, icedi, icerd, icewr(@icewr).
define_false_path -from { i:ice.host_interface.snatch.en_snatch };

# Ignore the iceeromcs timing of emem.
#
#   iceeromcs is latch signal generated from iceifa and clocked by eromclk.
#   iceeromcs is used to ...
#     (1)emem external i/f (ex. eromcs)
#     (2)cpu if (ex. ro)
#     (3)host read data (icedo)
#     (4)host write i/f (ex. icewritedata, icewr_start)
define_false_path -from { i:ice.emem.rom.iceeromcs };

# Ignore th ice_write timing of emem.
#   ice_write is latch signal clocked by romclk and generated from the signal clocked by icewr.
#ice_write --> icerd_mask    --> eromrd_b(emem i/f)
#                            --> eromwait --> "host_interface access control"
#          --> ice_user_res1 --> "host write i/f"
#          --> erompd --> "cpu bus"
define_false_path -from { i:ice.emem.rom.ice_write };


#
#  create_clock
#


# create_clock -name FIL15K [get_pins csc/rg/lvictl/counter/fil15kin_mux/root/N01] -period $Tclk ( _device_scr/d78f1070_clock.scr_32MHz_30ns L:122 )
define_clock { n:chiptop.chip.csc.rg.lvictl.counter.fil15kin } -name { FIL15K } -period 29.0 -clockgroup FIL15K -route 0.000

# create_clock -name R32MCLK [get_pins h_rosc/R32MOUT] -period $Tclk_dspo ( _device_scr/d78f1070_clock.scr_32MHz_30ns L:136 )
define_clock { n:chiptop.h_rosc.R32MOUT } -name { R32MCLK } -period 14.5 -clockgroup R32MCLK -route 0.000

# create_clock -name FMX4 [get_pins csc/cg/mosccnt/fmx4_cts/root/N01] -period  $Tclk        ( _device_scr/d78f1070_clock.scr_32MHz_30ns L:112 )
define_clock { n:chiptop.chip.csc.cg.mosccnt.fmx4 } -name { FMX4 } -period 29.0 -clockgroup FMX4 -route 0.000

# create_clock -name FIHFL [get_pins h_rosc/FIHFL] -period $Tclk ( _device_scr/d78f1070_clock.scr_32MHz_30ns L:151 )
define_clock { n:chiptop.h_rosc.FIHFL } -name { FIHFL } -period 29.0 -clockgroup FIHFL -route 0.000

# create_clock -name OCDCLK [get_pins ocd/main/uart/uart_bcounter/root/C3/N01] -period $Tclk  ( _device_scr/d78f1070_clock.scr_32MHz_30ns L:132 )
define_clock { n:chiptop.chip.ocd.main.uart.sclock_16m } -name { OCDCLK } -period 29.0 -clockgroup OCDCLK -route 0.000

# create_clock -name FIHP3 [get_pins csc/cg/hioscctl/fmain_sel/fih_p3_cts/root/N01] -period $Tclk_dspo ( _device_scr/d78f1070_clock.scr_32MHz_30ns L:108 )
define_clock { n:chiptop.chip.csc.cg.hioscctl.fmain_sel.fih_p3 } -name { FIHP3 } -period 14.5 -clockgroup FIHP3 -route 0.000

# create_clock -name FMAIN_PCLBUZ [get_pins pclbuz/fmain_cts/root/N01] -period  $Tclk     ( _device_scr/d78f1070_clock.scr_32MHz_30ns L:126 )
define_clock { n:chiptop.chip.pclbuz.fmain_scck } -name { FMAIN_PCLBUZ } -period 29.0 -clockgroup FMAIN_PCLBUZ -route 0.000

# create_clock -name FIHP1 [get_pins csc/cg/hioscctl/fmain_sel/fih_p1_cts/root/N01] -period $Tclk ( _device_scr/d78f1070_clock.scr_32MHz_30ns L:104 )
define_clock { n:chiptop.chip.csc.cg.hioscctl.fmain_sel.fih_p1 } -name { FIHP1 } -period 29.0 -clockgroup FIHP1 -route 0.000

# create_clock -name FCLK [get_pins csc/cg/tbase/fclk_cts/root/N01] -period  $Tclk          ( _device_scr/d78f1070_clock.scr_32MHz_30ns L:100 )
define_clock { n:chiptop.chip.csc.cg.tbase.fclk } -name { FCLK } -period 29.0 -clockgroup FCLK -route 0.000

# create_clock -name OSCOUTS [get_pins csc/cg/oscctl/root_oscouts/out] -period $OSCclk ( _device_scr/d78f1070_clock.scr_32MHz_30ns L:116 )
define_clock { n:chiptop.chip.csc.cg.oscouts_nf_p } -name { OSCOUTS } -period 29.0 -clockgroup OSCOUTS -route 0.000

# create_clock -name FSUB_PCLBUZ [get_pins pclbuz/fsub_cts/root/N01] -period  $Tclk     ( _device_scr/d78f1070_clock.scr_32MHz_30ns L:128 )
define_clock { n:chiptop.chip.pclbuz.fsub_scck } -name { FSUB_PCLBUZ } -period 29.0 -clockgroup FSUB_PCLBUZ -route 0.000

# create_clock -name SCANCLK [get_pins modectl/modectl_tport/scanbuf1/*/N01] -period $Sclk ( _device_scr/d78f1070_clock.scr_32MHz_30ns L:156 )
# Removed because of tool limitation or removed macro on ICE

# create_clock -name FIH4  [get_pins csc/cg/hioscctl/fihsync/fih4_cts/root/N01]  -period $Tclk ( _device_scr/d78f1070_clock.scr_32MHz_30ns L:106 )
define_clock { n:chiptop.chip.csc.cg.hioscctl.fihsync.fih4 } -name { FIH4 } -period 29.0 -clockgroup FIH4 -route 0.000

# create_clock -name FIL [get_pins l_rosc/LOSCOUT] -period $FILclk ( _device_scr/d78f1070_clock.scr_32MHz_30ns L:140 )
define_clock { n:chiptop.l_rosc.LOSCOUT } -name { FIL } -period 29.0 -clockgroup FIL -route 0.000





#
#  set_case_analysis
#


# set_case_analysis 0 [get_pins modectl/TESDBT] ( _device_scr/d78f1070_mode.scr_100920 L:55 )
define_attribute { t:chiptop.chip.modectl.TESDBT } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins modectl/TESSCAN3] ( _device_scr/d78f1070_mode.scr_100920 L:36 )
define_attribute { t:chiptop.chip.modectl.TESSCAN3 } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins modectl/modectl_top/modectl_main/test_mode/tesinst] ( _device_scr/d78f1070_mode.scr_100920 L:43 )
define_attribute { t:chiptop.chip.modectl.modectl_top.modectl_main.test_mode.tesinst } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins modectl/BBTESINST] ( _device_scr/d78f1070_mode.scr_100920 L:40 )
define_attribute { t:chiptop.chip.modectl.BBTESINST } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins modectl/TESSCAN2] ( _device_scr/d78f1070_mode.scr_100920 L:34 )
define_attribute { t:chiptop.chip.modectl.TESSCAN2 } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins modectl/OPTMDUMP] ( _device_scr/d78f1070_mode.scr_100920 L:65 )
define_attribute { t:chiptop.chip.modectl.OPTMDUMP } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins modectl/TESSCAN1] ( _device_scr/d78f1070_mode.scr_100920 L:33 )
define_attribute { t:chiptop.chip.modectl.TESSCAN1 } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins modectl/TESUSR] ( _device_scr/d78f1070_mode.scr_100920 L:52 )
define_attribute { t:chiptop.chip.modectl.TESUSR } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins modectl/PTESINST] ( _device_scr/d78f1070_mode.scr_100920 L:46 )
define_attribute { t:chiptop.chip.modectl.PTESINST } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins modectl/modectl_tport/scanbuf2/scandrive/N01] ( _device_scr/d78f1070_mode.scr_100920 L:24 )
define_attribute { t:chiptop.chip.modectl.modectl_tport.scanbuf2.scandrive } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins modectl/TESTMOD] ( _device_scr/d78f1070_mode.scr_100920 L:30 )
define_attribute { t:chiptop.chip.modectl.TESTMOD } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins modectl/SCANEN] ( _device_scr/d78f1070_mode.scr_100920 L:20 )
define_attribute { t:chiptop.chip.modectl.SCANEN } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins modectl/TESDBT2] ( _device_scr/d78f1070_mode.scr_100920 L:56 )
define_attribute { t:chiptop.chip.modectl.TESDBT2 } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins modectl/OPTBCT] ( _device_scr/d78f1070_mode.scr_100920 L:59 )
define_attribute { t:chiptop.chip.modectl.OPTBCT } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins modectl/OPTIDDQ] ( _device_scr/d78f1070_mode.scr_100920 L:49 )
define_attribute { t:chiptop.chip.modectl.OPTIDDQ } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins modectl/OPTDFL] ( _device_scr/d78f1070_mode.scr_100920 L:62 )
define_attribute { t:chiptop.chip.modectl.OPTDFL } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins modectl/SCANMODE] ( _device_scr/d78f1070_mode.scr_100920 L:27 )
define_attribute { t:chiptop.chip.modectl.SCANMODE } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins modectl/TESSCAN4] ( _device_scr/d78f1070_mode.scr_100920 L:37 )
define_attribute { t:chiptop.chip.modectl.TESSCAN4 } xc_pulldown { 1 }





#
#  reset_path
#


# reset_path -from DRDCLK -to [all_clocks] ( _device_scr/d78f1070_chip.scr_101019 L:77 )
# Unconvert constraint

# reset_path -from FCLK -to DRDCLK ( _device_scr/d78f1070_chip.scr_101019 L:78 )
# Unconvert constraint

# reset_path -from $CLOCK -to $CLOCK ( _device_scr/d78f1070_chip.scr_101019 L:71 )
# Unconvert constraint

# reset_path -from [get_clock FIHFL] -to [get_clock FCLK] ( _device_scr/d78f1070_chip.scr_101019 L:80 )
# Unconvert constraint





#
#  set_max_delay
#


# set_max_delay $DLY_1_per_2 -thr [get_pins cap*/STPBCKBT*] -from [get_pins csc/cg/tbase/stby/stopbaseck_reg/H02] ( _device_scr/d78f1070_chip.scr_101019 L:742 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay ${SCK_OUT_DLY_08Mbps} -from sau0/ch0/sckctl_scko_reg/H02 -to port5_iobuf/iobuf5/DOUT ( _device_scr/d78f1070_chip.scr_101019 L:1190 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_2_per_6 -thr [get_pins cap*/BBPWRITE] -from [list [get_pins cpu/alu/cpuwr_pre_reg/H02 ] [get_pins cpu/alu/sp_sfr_msk_reg/H02 ] [get_pins cpu/clk/DMA_read_reg/H02 ] [get_pins cpu/clk/DMA_write_reg/H02 ]  ] ( _device_scr/d78f1070_chip.scr_101019 L:752 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_1 -thr [get_pins cap*/BBCKSTR*]  -from [get_pins csc/cg/hioscctl/fmain_sel/cksel_fih_p2/ckmsk2_reg/H02 ] ( _device_scr/d78f1070_chip.scr_101019 L:953 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_2 -thr [get_pins cap*/BBHIOON*] -to [list [get_pins csc/cg/hioscctl/fmain_sel/maskctl/reqfih_f1_reg/H01 ] ]  -from [get_pins cap*/cap/SIGO*] ( _device_scr/d78f1070_chip.scr_101019 L:1070 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_1 -thr [get_pins cap*/WDOP*] -from [list [get_pins dmac/main/dmaack_delay_reg_*_/H02 ] [get_pins dmac/main/dmapr_reg/H02 ] [get_pins dmac/main/sfr/ds*_reg/H02 ] [get_pins dmac/main/sfr/dst*_reg/H02 ]  ] ( _device_scr/d78f1070_chip.scr_101019 L:924 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay ${SO_OUT_DLY_08Mbps} -from [list sau0/ch3/regu_md_reg_1_/H02 sau0/ch3/regu_md_reg_2_/H02 sau0/ch3/soctl_sout_reg/H02 ]  -to port5_iobuf/iobuf1/DOUT ( _device_scr/d78f1070_chip.scr_101019 L:1154 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_1 -thr [get_pins cap*/SLMEM*] -from [list [get_pins dmac/main/sfr/dst0_reg/H02 ] [get_pins dmac/main/dmaack_delay_reg_*_/H02 ] [get_pins dmac/main/dmapr_reg/H02 ] [get_pins dmac/main/sfr/dst*_reg/H02 ]  ] ( _device_scr/d78f1070_chip.scr_101019 L:889 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay ${SI_IN_DLY_16Mbps} -from port1_iobuf/iobuf1/DIN  -to sau0/nf0/ff1_reg/H01 ( _device_scr/d78f1070_chip.scr_101019 L:1112 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay ${SCK_OUT_DLY_08Mbps} -from sau0/ch2/sckctl_scko_reg/H02 -to port0_iobuf/iobuf4/DOUT ( _device_scr/d78f1070_chip.scr_101019 L:1137 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_2 -thr [get_pins cap*/BBCKSELR*] -to [list [get_pins csc/cg/hioscctl/fmain_sel/cksel_fih_p2/ckmsk1_p_reg/H01 ] [get_pins csc/cg/hioscctl/fmain_sel/cksel_fih_p2/ckmsk2_p_reg/H01 ] [get_pins csc/cg/hioscctl/fmain_sel/maskctl/reqfih_f1_reg/H01 ] ]  -from [get_pins cap*/cap/SIGO*] ( _device_scr/d78f1070_chip.scr_101019 L:1009 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay ${SO_OUT_DLY_08Mbps} -from [list sau1/ch1/regu_md_reg_1_/H02 sau1/ch1/regu_md_reg_2_/H02 sau1/ch1/soctl_sout_reg/H02 ]  -to port7_iobuf/iobuf2/DOUT ( _device_scr/d78f1070_chip.scr_101019 L:1180 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_2 -thr [get_pins cap*/WDOP*] -from [list [get_pins cpu/adr_fchiram_pre_reg/H02 ] [get_pins cpu/adr_ivack_reg/H02 ] [get_pins cpu/adr_pa_data_buf_reg/H02 ] [get_pins cpu/adr_pa_data_maw_reg/H02 ] [get_pins cpu/adr_pa_data_mem_reg/H02 ] [get_pins cpu/adr_pa_data_mlt1_reg/H02 ] [get_pins cpu/alu/cpuwr_pre_reg/H02 ] [get_pins cpu/alu/fchiram_cpurd_reg/H02 ] [get_pins cpu/alu/sp_sfr_msk_reg/H02 ] [get_pins cpu/clk/DMA_read_reg/H02 ] [get_pins cpu/clk/DMA_write_reg/H02 ] [get_pins cpu/dec_dec_word_access_reg/H02 ]  ] ( _device_scr/d78f1070_chip.scr_101019 L:908 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay ${SO_OUT_DLY_08Mbps} -from [list sau0/ch2/regu_md_reg_1_/H02 sau0/ch2/regu_md_reg_2_/H02 sau0/ch2/soctl_sout_reg/H02 ]  -to port0_iobuf/iobuf2/DOUT ( _device_scr/d78f1070_chip.scr_101019 L:1141 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_1 -thr [get_pins cap*/BCKHSEN*] -from [list [get_pins csc/cg/regi/css_reg/H02 ] [get_pins csc/cg/regi/dxtstop_reg/H02 ] [get_pins csc/cg/tbase/fmain_fsub_sel/cksel_fmain_fsub/ckmsk2_reg/H02 ] [get_pins csc/cg/tbase/stby/hltst1_reg/H02 ] [get_pins csc/cg/tbase/stby/psubmode_b_reg/H02 ] [get_pins csc/cg/tbase/stby/stopbaseck_reg/H02 ]  ] ( _device_scr/d78f1070_chip.scr_101019 L:978 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_2_per_6 -thr [get_pins cap*/BBPENABLE] -from [list [get_pins cpu/alu/cpurd_pre_reg/H02 ] [get_pins cpu/alu/cpuwr_pre_reg/H02 ] [get_pins cpu/alu/sp_sfr_msk_reg/H02 ] [get_pins cpu/clk/DMA_read_reg/H02 ] [get_pins cpu/clk/DMA_write_reg/H02 ]  ] ( _device_scr/d78f1070_chip.scr_101019 L:768 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay ${SO_OUT_DLY_08Mbps} -from [list sau1/ch0/regu_md_reg_1_/H02 sau1/ch0/regu_md_reg_2_/H02 sau1/ch0/soctl_sout_reg/H02 ]  -to port1_iobuf/iobuf3/DOUT ( _device_scr/d78f1070_chip.scr_101019 L:1167 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_6 -thr [get_pins cap*/BBWAITMEM*]  -to [list [get_pins cpu/adr_wait2ndsfr_reg/H01 ] ]  -from [get_pins cap*/cap/SIGO*] ( _device_scr/d78f1070_chip.scr_101019 L:1033 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_2 -thr [get_pins cap*/GDRAMWR*] -from [list [get_pins porga/main/regctl_iawen_reg/H02 ] [get_pins dmac/main/dmaack_delay_reg_*_/H02 ] [get_pins dmac/main/sfr/drs*_reg/H02 ]  ] ( _device_scr/d78f1070_chip.scr_101019 L:946 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_1 -thr [get_pins cap*/SEL08P*]  -from [get_pins porga/main/regctl_pclm_ft3_*/cap_bit_reg_*_/H02] ( _device_scr/d78f1070_chip.scr_101019 L:968 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay ${SI_IN_DLY_08Mbps} -from port7_iobuf/iobuf1/DIN  -to sau1/sync1/ff1_reg/H01 ( _device_scr/d78f1070_chip.scr_101019 L:1178 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay 25.0 -thr cibc/PWDATA* -to cibc/fmop/main_trmlv_bgrtc_latch_bgrtc_*/ft3_latch*/H01 ( _device_scr/d78f1070_chip.scr_101019 L:224 )
define_max_delay -through { n:chiptop.chip.cibc.PWDATA* } -to { i:chiptop.chip.cibc.fmop.main.trmlv.bgrtc_latch_bgrtc_*.ft3_latch*.DLSFQ2_inst.LDCPE_inst } { 25.0 }

# set_max_delay $DLY_1_per_2 -thr [get_pins cap*/BBINT*]  -to [list [get_pins dmac/main/trigsel0/edge_detect_reg_0_/H01 ] [get_pins dmac/main/trigsel1/edge_detect_reg_0_/H01 ] [get_pins int48/main/sfrreg/IFREG28/ed_reg_reg/H02 ] [get_pins int48/main/sfrreg/IFREG29/ed_reg_reg/H02 ] [get_pins int48/main/sfrreg/IFREG30/ed_reg_reg/H02 ] [get_pins int48/main/sfrreg/IFREG35/ed_reg_reg/H02 ] [get_pins int48/main/sfrreg/IFREG36/ed_reg_reg/H02 ] [get_pins int48/main/sfrreg/IFREG37/ed_reg_reg/H02 ] [get_pins int48/main/sfrreg/IFREG38/ed_reg_reg/H02 ] [get_pins int48/main/sfrreg/IFREG39/ed_reg_reg/H02 ] [get_pins int48/main/sfrreg/IFREG40/ed_reg_reg/H02 ] [get_pins int48/main/sfrreg/IFREG41/ed_reg_reg/H02 ] [get_pins int48/main/sfrreg/IFREG42/ed_reg_reg/H02 ] [get_pins int48/main/sfrreg/IFREG43/ed_reg_reg/H02 ] [get_pins int48/main/sfrreg/IFREG44/ed_reg_reg/H02 ] [get_pins int48/main/sfrreg/IFREG46/ed_reg_reg/H02 ] ]  -from [get_pins cap*/cap/SIGO*] ( _device_scr/d78f1070_chip.scr_101019 L:1038 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_2 -thr [get_pins cap*/RESB] -from [get_pins csc/cg/tbase/stby/resbgen/nsresb_reg/H02] ( _device_scr/d78f1070_chip.scr_101019 L:740 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_2 -thr [get_pins cap*/BBREQPCLK*] -to [list [get_pins csc/cg/hioscctl/fihsync/cnt_rsts_reg_async_*_reg/H01 ] [get_pins csc/cg/hioscctl/fihsync/cnt_rsts_reg_sync_reg_*_/H01 ] [get_pins csc/cg/hioscctl/fihsync/rsts_reg/H01 ] [get_pins csc/cg/hioscctl/fmain_sel/maskctl/reqfih_f1_reg/H01 ] [get_pins csc/cg/pec/per0*_gate/H01 ] [get_pins csc/cg/pec/prsu_gate/H01 ] [get_pins csc/cg/pec/reqpclk_all_p_reg/H01 ] ]  -from [get_pins cap*/cap/SIGO*] ( _device_scr/d78f1070_chip.scr_101019 L:998 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_1 -thr [get_pins cap*/FMXST*]  -from [get_pins csc/cg/hioscctl/fmain_sel/cksel_fmain_p/ckmsk2_reg/H02 ] ( _device_scr/d78f1070_chip.scr_101019 L:972 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_2 -thr [get_pins cap*/BBCKSELM*] -to [list [get_pins csc/cg/hioscctl/fmain_sel/cksel_fmx/ckmsk1_p_reg/H01 ] [get_pins csc/cg/hioscctl/fmain_sel/cksel_fmx/ckmsk2_p_reg/H01 ] ]  -from [get_pins cap*/cap/SIGO*] ( _device_scr/d78f1070_chip.scr_101019 L:1064 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_1 -thr [get_pins cap*/SUBCKST*]  -from [get_pins csc/cg/tbase/fmain_fsub_sel/cksel_fmain_fsub/ckmsk2_reg/H02 ] ( _device_scr/d78f1070_chip.scr_101019 L:975 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_2 -thr [get_pins cap*/SYSRESB] -from [get_pins csc/rg/resctl_main/*_ff/*_reg/H02] ( _device_scr/d78f1070_chip.scr_101019 L:738 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_2 -thr [get_pins cap*/RSTS] -from [get_pins csc/cg/hioscctl/fihsync/rsts_reg/H02] ( _device_scr/d78f1070_chip.scr_101019 L:743 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay ${SI_IN_DLY_08Mbps} -from port5_iobuf/iobuf0/DIN  -to sau0/sync3/ff1_reg/H01 ( _device_scr/d78f1070_chip.scr_101019 L:1152 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay ${SI_IN_DLY_08Mbps} -from port1_iobuf/iobuf6/DIN  -to sau0/nf0/ff1_reg/H01 ( _device_scr/d78f1070_chip.scr_101019 L:1192 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay ${SCK_OUT_DLY_08Mbps} -from sau0/ch3/sckctl_scko_reg/H02 -to port3_iobuf/iobuf0/DOUT ( _device_scr/d78f1070_chip.scr_101019 L:1150 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_2 -thr [list [get_pins cap*/SVSTOP*] [get_pins cap*/SVPERI*] ] -from [list [get_pins cpu/adr_monmd_pre_reg/H02 ] [get_pins ocd/main/brkctl/reg_ctl_toolen_reg_*_/H02 ] [get_pins ocd/main/brkctl/reg_ctl_frzen*_reg/H02 ]  ] ( _device_scr/d78f1070_chip.scr_101019 L:863 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_2_per_3 -thr [get_pins cap*/BBPENABLE] -from [list [get_pins dmac/main/dmaack_delay_reg_0_/H02 ] [get_pins dmac/main/dmaack_delay_reg_1_/H02 ] [get_pins dmac/main/dmapr_reg/H02 ] [get_pins dmac/main/sfr/dst0_reg/H02 ] [get_pins dmac/main/sfr/dst1_reg/H02 ]  ] ( _device_scr/d78f1070_chip.scr_101019 L:776 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay ${SO_OUT_DLY_08Mbps} -from [list sau0/ch0/regu_md_reg_1_/H02 sau0/ch0/regu_md_reg_2_/H02 sau0/ch0/soctl_sout_reg/H02 ] -through port1_iobuf/sel2/H02  -to port1_iobuf/iobuf7/DOUT ( _device_scr/d78f1070_chip.scr_101019 L:1194 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_2 -thr [get_pins cap*/BBPRDATA*] -to [list [get_pins cpu/adr_id_que*_reg_*_/H01 ] [get_pins cpu/adr_ID_stage*_reg_*_/H01 ] [get_pins cpu/alu/*_bank*_reg_*_/H01 ] [get_pins cpu/alu/AC_reg/H01 ] [get_pins cpu/alu/buf*_reg_*_/H01 ] [get_pins cpu/alu/ES_reg_*_/H01 ] [get_pins cpu/alu/IE_reg/H01 ] [get_pins cpu/alu/ISP_reg_*_/H01 ] [get_pins cpu/alu/RBS_reg_*_/H01 ] [get_pins cpu/alu/SP_reg_*_/H01 ] [get_pins cpu/alu/stage_cut_alu_reg/H01 ] [get_pins cpu/alu/Z_reg/H01 ] ]  -from [get_pins cap*/cap/SIGO*] ( _device_scr/d78f1070_chip.scr_101019 L:1016 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_2 -thr [get_pins cap*/ADTRIG*]  -to [list [get_pins adctl/core/sync/trgsync_1_reg/H01 ] [get_pins adctl/core/wup/reqpclk_async_reg/H02 ] ]  -from [get_pins cap*/cap/SIGO*] ( _device_scr/d78f1070_chip.scr_101019 L:1058 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_2 -thr [get_pins cap*/MODE*] -from [list [get_pins cibc/fmop/main_fmopb_fmopb_cmode_reg_0_/H02 ] [get_pins cibc/fmop/main_fmopb_fmopb_cmode_reg_1_/H02 ] [get_pins csc/cg/regctl/subck_delay_reg/H02 ] [get_pins csc/cg/regi/css_reg/H02 ]  ] ( _device_scr/d78f1070_chip.scr_101019 L:937 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_1 -thr [get_pins cap*/BBCKSTM*]  -from [get_pins csc/cg/hioscctl/fmain_sel/cksel_fmx/ckmsk2_reg/H02 ] ( _device_scr/d78f1070_chip.scr_101019 L:965 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay ${SCK_OUT_DLY_08Mbps} -from sau1/ch0/sckctl_scko_reg/H02 -to port1_iobuf/iobuf5/DOUT ( _device_scr/d78f1070_chip.scr_101019 L:1163 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay ${SCK_OUT_DLY_08Mbps} -from sau0/ch1/sckctl_scko_reg/H02 -to port7_iobuf/iobuf5/DOUT ( _device_scr/d78f1070_chip.scr_101019 L:1124 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_2_per_3 -thr [list [get_pins cap*/BBMA*] [get_pins cap*/BBSELSFR*] ] -from [list [get_pins dmac/main/dmaack_delay_reg_*_/H02 ] [get_pins dmac/main/dmapr_reg/H02 ] [get_pins dmac/main/sfr/dra*_reg_*_/H02 ] [get_pins dmac/main/sfr/drs*_reg/H02 ] [get_pins dmac/main/sfr/dst*_reg/H02 ]  ] ( _device_scr/d78f1070_chip.scr_101019 L:816 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay 25.0 -thr cibc/PWDATA* -to cibc/fmop/main_trmlv_bgrt_latch_bgrt_*/ft3_latch*/H01 ( _device_scr/d78f1070_chip.scr_101019 L:225 )
define_max_delay -through { n:chiptop.chip.cibc.PWDATA* } -to { i:chiptop.chip.cibc.fmop.main.trmlv.bgrt_latch_bgrt_*.ft3_latch*.DLSFQ2_inst.LDCPE_inst } { 25.0 }

# set_max_delay $DLY_1_per_1 -thr [get_pins cap*/BBNVM*]  -from [get_pins cibc/cib/ccnt_resseq_rstate_reg_*_/H02 ] ( _device_scr/d78f1070_chip.scr_101019 L:859 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_2_per_1 -thr [get_pins cap*/MDWFLRO*] -from [list [get_pins dmac/main/dmaack_delay_reg_*_/H02 ] [get_pins dmac/main/dmapr_reg/H02 ] [get_pins dmac/main/sfr/dra*_reg_*_/H02 ] [get_pins dmac/main/sfr/drs*_reg/H02 ] [get_pins dmac/main/sfr/dst*_reg/H02 ]  ] ( _device_scr/d78f1070_chip.scr_101019 L:850 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_2 -thr [get_pins cap*/FCHRAM*] -from [list [get_pins cpu/adr_fchiram_pre_reg/H02 ] [get_pins cpu/adr_ivack_reg/H02 ] [get_pins cpu/adr_pa_data_buf_reg/H02 ] [get_pins cpu/adr_pa_data_maw_reg/H02 ] [get_pins cpu/adr_pa_data_mlt1_reg/H02 ] [get_pins cpu/alu/mem_access_reg/H02 ]  ] ( _device_scr/d78f1070_chip.scr_101019 L:898 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_2 -thr [get_pins cap*/*STN*]  -from [get_pins csc/cg/regi/tstn_reg/H02 ] ( _device_scr/d78f1070_chip.scr_101019 L:933 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_2 -thr [get_pins cap*/BBRPERR*] -to [list [get_pins csc/rg/resctl_main/resf_reg_wr/rpef_reg/H01 ] ]  -from [get_pins cap*/cap/SIGO*] ( _device_scr/d78f1070_chip.scr_101019 L:993 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_2 -thr [get_pins cap*/RESETB] -from [get_pins csc/rg/resctl_main/*_ff/*_reg/H02] ( _device_scr/d78f1070_chip.scr_101019 L:739 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_2_per_3 -thr [get_pins cap*/BBPWRITE] -from [list [get_pins dmac/main/dmaack_delay_reg_0_/H02 ] [get_pins dmac/main/dmaack_delay_reg_1_/H02 ] [get_pins dmac/main/dmapr_reg/H02 ] [get_pins dmac/main/sfr/dst0_reg/H02 ] [get_pins dmac/main/sfr/dst1_reg/H02 ]  ] ( _device_scr/d78f1070_chip.scr_101019 L:759 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_2 -thr [get_pins cap*/RESSTP] -from [list [get_pins csc/cg/tbase/stby/stpst2_reg/H02] [get_pins csc/rg/resctl_main/*_ff/*_reg/H02]  ] ( _device_scr/d78f1070_chip.scr_101019 L:745 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay ${SCK_OUT_DLY_16Mbps} -from sau0/ch0/sckctl_scko_reg/H02 -to port1_iobuf/iobuf0/DOUT ( _device_scr/d78f1070_chip.scr_101019 L:1110 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_1 -thr [get_pins cap*/MDWFLRO*] -from [list [get_pins cpu/adr_fchiram_pre_reg/H02 ] [get_pins cpu/adr_ivack_reg/H02 ] [get_pins cpu/adr_ma_pre_reg_0_/H02 ] [get_pins cpu/adr_MEM_stage0_reg_0_/H02 ] [get_pins cpu/adr_pa_data_buf_reg/H02 ] [get_pins cpu/adr_pa_data_maw_reg/H02 ] [get_pins cpu/adr_pa_data_mem_reg/H02 ] [get_pins cpu/adr_pa_data_mlt1_reg/H02 ] [get_pins cpu/alu/*_bank*_reg_*_/H02 ] [get_pins cpu/alu/*_bank*_reg_*_/H02 ] [get_pins cpu/alu/buf*_reg_*_/H02 ] [get_pins cpu/alu/cpuwr_pre_reg/H02 ] [get_pins cpu/alu/fchiram_cpurd_reg/H02 ] [get_pins cpu/alu/RBS_reg_*_/H02 ] [get_pins cpu/alu/sp_sfr_msk_reg/H02 ] [get_pins cpu/clk/DMA_read_reg/H02 ] [get_pins cpu/clk/DMA_write_reg/H02 ] [get_pins cpu/dec_dec_alu_transout_reg_*_/H02 ]  ] ( _device_scr/d78f1070_chip.scr_101019 L:828 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_2_per_6 -thr [list [get_pins cap*/BBMA*] [get_pins cap*/BBSELSFR*] ] -from [list [get_pins cpu/adr_ID_stage0_reg_*_/H02 ] [get_pins cpu/adr_ID_stage1_dec_reg_*_/H02 ] [get_pins cpu/adr_fchiram_pre_reg/H02 ] [get_pins cpu/adr_ivack_reg/H02 ] [get_pins cpu/adr_ma_enable_fchiram_reg/H02 ] [get_pins cpu/adr_ma_enable_slv_reg/H02 ] [get_pins cpu/adr_ma_pre_reg_*_/H02 ] [get_pins cpu/adr_pa_data_buf_reg/H02 ] [get_pins cpu/adr_pa_data_maw_reg/H02 ] [get_pins cpu/adr_pa_data_mem_reg/H02 ] [get_pins cpu/adr_pa_data_mlt1_reg/H02 ] [get_pins cpu/adr_pc_wait_cnt_reg_*_/H02 ] [get_pins cpu/adr_rstvec_reg/H02 ] [get_pins cpu/adr_slmem_pre_reg/H02 ] [get_pins cpu/adr_stage_adr_reg_*_/H02 ] [get_pins cpu/alu/CY_reg/H02 ] [get_pins cpu/alu/Z_reg/H02 ] [get_pins cpu/alu/cpurd_pre_reg/H02 ] [get_pins cpu/alu/cpuwr_pre_reg/H02 ] [get_pins cpu/alu/prefix_skp_reg/H02 ] [get_pins cpu/alu/skip_*_reg/H02 ] [get_pins cpu/alu/sp_sfr_msk_reg/H02 ] [get_pins cpu/clk/DMA_read_reg/H02 ] [get_pins cpu/clk/DMA_write_reg/H02 ]  ] ( _device_scr/d78f1070_chip.scr_101019 L:785 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay ${SO_OUT_DLY_16Mbps} -from [list sau0/ch0/regu_md_reg_1_/H02 sau0/ch0/regu_md_reg_2_/H02 sau0/ch0/soctl_sout_reg/H02 ]  -to port1_iobuf/iobuf2/DOUT ( _device_scr/d78f1070_chip.scr_101019 L:1114 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay ${SI_IN_DLY_08Mbps} -from port1_iobuf/iobuf4/DIN  -to sau1/nf0/ff1_reg/H01 ( _device_scr/d78f1070_chip.scr_101019 L:1165 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay ${SCK_OUT_DLY_08Mbps} -from sau1/ch1/sckctl_scko_reg/H02 -to port7_iobuf/iobuf0/DOUT ( _device_scr/d78f1070_chip.scr_101019 L:1176 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay ${SO_OUT_DLY_08Mbps} -from [list sau0/ch1/regu_md_reg_1_/H02 sau0/ch1/regu_md_reg_2_/H02 sau0/ch1/soctl_sout_reg/H02 ]  -to port7_iobuf/iobuf3/DOUT ( _device_scr/d78f1070_chip.scr_101019 L:1128 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_2 -thr [get_pins cap*/SLMEM*] -from [list [get_pins cpu/adr_ID_stage0_reg_*_/H02 ] [get_pins cpu/adr_ID_stage1_dec_reg_*_/H02 ] [get_pins cpu/adr_fchiram_pre_reg/H02 ] [get_pins cpu/adr_ma_enable_slv_reg/H02 ] [get_pins cpu/alu/CY_reg/H02 ] [get_pins cpu/alu/Z_reg/H02 ] [get_pins cpu/alu/prefix_skp_reg/H02 ] [get_pins cpu/alu/skip_h_reg/H02 ] [get_pins cpu/alu/skip_nz_reg/H02 ] [get_pins cpu/alu/sp_sfr_msk_reg/H02 ] [get_pins cpu/clk/DMA_read_reg/H02 ]  ] ( _device_scr/d78f1070_chip.scr_101019 L:874 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay ${SI_IN_DLY_08Mbps} -from port0_iobuf/iobuf3/DIN  -to sau0/nf2/ff1_reg/H01 ( _device_scr/d78f1070_chip.scr_101019 L:1139 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay ${SI_IN_DLY_08Mbps} -from port7_iobuf/iobuf4/DIN  -to sau0/sync1/ff1_reg/H01 ( _device_scr/d78f1070_chip.scr_101019 L:1126 )
# Removed because of tool limitation or removed macro on ICE

# set_max_delay $DLY_1_per_2 -thr [get_pins cap*/BBREGCTL*] -to [list [get_pins regm/REGLC ] ]  -from [get_pins cap*/cap/SIGO*] ( _device_scr/d78f1070_chip.scr_101019 L:1075 )
# Removed because of tool limitation or removed macro on ICE





#
#  create_generated_clock
#







#
#  set_multicycle_path
#


# set_multicycle_path 2 -setup -from csc/cg/tbase/stby/resbgen/nsresb_reg/H02 -to csc/cg/tbase/stby/hltst1_neg_reg/H03 ( _device_scr/d78f1070_chip.scr_101019 L:254 )
define_multicycle_path -from { i:chiptop.chip.csc.cg.tbase.stby.resbgen.nsresb } -to { i:chiptop.chip.csc.cg.tbase.stby.hltst1_neg } { 2 }

# set_multicycle_path 2 -setup -from cibc/cib/ccnt_resseq_rstate_reg_*_   -to flash_code/CE ( _device_scr/d78f1070_chip.scr_101019 L:239 )
# Removed because of tool limitation or removed macro on ICE

# set_multicycle_path 1 -hold -end -from [list fcb/wcbctl/af_reg_*_/H02]   -to [list flash_data/DA*] ( _device_scr/d78f1070_chip.scr_101019 L:268 )
# Removed because of tool limitation or removed macro on ICE

# set_multicycle_path 2 -setup -from cibc/cib/ccnt_resseq_rstate_reg_*_   -to flash_cp/CE ( _device_scr/d78f1070_chip.scr_101019 L:243 )
# Removed because of tool limitation or removed macro on ICE

# set_multicycle_path 2 -setup -from flash_code/RDCLKC1 -to cibc/fmop/main_trm2_trm2_rxflagz_reg_*_ ( _device_scr/d78f1070_chip.scr_101019 L:248 )
# Removed because of tool limitation or removed macro on ICE

# set_multicycle_path 2 -hold -thr cpu/* -to flash_data/DA* ( _device_scr/d78f1070_chip.scr_101019 L:264 )
# Removed because of tool limitation or removed macro on ICE

# set_multicycle_path 1 -hold -end -thr   fcb/* -to [list flash_data/DCE] ( _device_scr/d78f1070_chip.scr_101019 L:271 )
# Removed because of tool limitation or removed macro on ICE

# set_multicycle_path 1 -hold  -from csc/cg/tbase/stby/resbgen/nsresb_reg/H02 -to csc/cg/tbase/stby/hltst1_neg_reg/H03 ( _device_scr/d78f1070_chip.scr_101019 L:255 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 1 -hold  -from flash_code/RDCLKC1 -to cibc/fmop/main_trm0_trm0_idp_reg_*_ ( _device_scr/d78f1070_chip.scr_101019 L:247 )
# Removed because of tool limitation or removed macro on ICE

# set_multicycle_path 1 -hold -thr cpu/HLTST -thr modectl/SELTAF -thr cibc/SELTAF ( _device_scr/d78f1070_chip.scr_101019 L:184 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 1 -hold -end -thr   fcb/* -to [list flash_cp/DCE] ( _device_scr/d78f1070_chip.scr_101019 L:272 )
# Removed because of tool limitation or removed macro on ICE

# set_multicycle_path 2 -hold -thr cpu/* -to flash_data/DCE ( _device_scr/d78f1070_chip.scr_101019 L:265 )
# Removed because of tool limitation or removed macro on ICE

# set_multicycle_path 1 -hold  -from cibc/cib/ccnt_resseq_rstate_reg_*_   -to flash_cp/CE ( _device_scr/d78f1070_chip.scr_101019 L:244 )
# Removed because of tool limitation or removed macro on ICE

# set_multicycle_path 1 -hold  -from flash_code/RDCLKC1 -to cibc/fmop/main_trm2_trm2_rxflagz_reg_*_ ( _device_scr/d78f1070_chip.scr_101019 L:249 )
# Removed because of tool limitation or removed macro on ICE

# set_multicycle_path 1 -hold -end -from [list fcb/regrw/flpmc*_reg_*_/H02] -to [list flash_data/DA*] ( _device_scr/d78f1070_chip.scr_101019 L:270 )
# Removed because of tool limitation or removed macro on ICE

# set_multicycle_path 1 -hold  -from cibc/cib/ccnt_resseq_rstate_reg_*_   -to flash_code/A* ( _device_scr/d78f1070_chip.scr_101019 L:238 )
# Removed because of tool limitation or removed macro on ICE

# set_multicycle_path 2 -setup -from cibc/cib/ccnt_resseq_rstate_reg_*_   -to flash_code/A* ( _device_scr/d78f1070_chip.scr_101019 L:237 )
# Removed because of tool limitation or removed macro on ICE

# set_multicycle_path 2 -setup -end  -through  [get_pins [list fcb/ONBD fcb/FLMEMTES fcb/ICENOECC fcb/ICEFLERR fcb/TFWEPR fcb/SCANMODE]] ( _device_scr/d78f1070_chip.scr_101019 L:174 )
#define_multicycle_path -through { n:chiptop.chip.fcb.ONBD n:chiptop.chip.fcb.FLMEMTES n:chiptop.chip.fcb.ICENOECC n:chiptop.chip.fcb.ICEFLERR n:chiptop.chip.fcb.TFWEPR n:chiptop.chip.fcb.SCANMODE } { 2 }

# set_multicycle_path 2 -hold -thr cpu/* -to flash_cp/DCE ( _device_scr/d78f1070_chip.scr_101019 L:266 )
# Removed because of tool limitation or removed macro on ICE

# set_multicycle_path 1 -hold  -from cibc/cib/ccnt_resseq_rstate_reg_*_   -to flash_code/CE ( _device_scr/d78f1070_chip.scr_101019 L:240 )
# Removed because of tool limitation or removed macro on ICE

# set_multicycle_path 1 -hold  -end  -through  [get_pins [list fcb/ONBD fcb/FLMEMTES fcb/ICENOECC fcb/ICEFLERR fcb/TFWEPR fcb/SCANMODE]] ( _device_scr/d78f1070_chip.scr_101019 L:175 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 2 -setup -from flash_code/RDCLKC1 -to cibc/fmop/main_trm0_trm0_idp_reg_*_ ( _device_scr/d78f1070_chip.scr_101019 L:246 )
# Removed because of tool limitation or removed macro on ICE

# set_multicycle_path 2 -setup -from cibc/cib/ccnt_resseq_rstate_reg_*_   -to flash_code/EXA ( _device_scr/d78f1070_chip.scr_101019 L:241 )
# Removed because of tool limitation or removed macro on ICE

# set_multicycle_path 2 -setup -thr cpu/HLTST -thr modectl/SELTAF -thr cibc/SELTAF ( _device_scr/d78f1070_chip.scr_101019 L:183 )
# define_multicycle_path -through { n:chiptop.chip.cpu.HLTST } -through { n:chiptop.chip.modectl.SELTAF } -through { n:chiptop.chip.cibc.SELTAF } { 2 } # force changed
define_multicycle_path -through { n:chiptop.chip.cpu.HLTST } -through { n:chiptop.chip.SELTAF } { 2 }

# set_multicycle_path 1 -hold  -from cibc/cib/ccnt_resseq_rstate_reg_*_   -to flash_code/EXA ( _device_scr/d78f1070_chip.scr_101019 L:242 )
# Removed because of tool limitation or removed macro on ICE





#
#  set_max_time_borrow
#








#
#  set_false_path
#


# set_false_path -from csc/rg/lvictl/main/lvimd_r_2_reg -to csc/rg/lvictl/main/lvimd_p_reg_0_/H03 ( _device_scr/d78f1070_chip.scr_101019 L:294 )
define_false_path -from { i:chiptop.chip.csc.rg.lvictl.main.lvimd_r_2 } -to { i:chiptop.chip.csc.rg.lvictl.main.lvimd_p[0] }

# set_false_path -from [all_clocks] -to [get_clocks SCANCLK] ( _device_scr/d78f1070_clock.scr_32MHz_30ns L:162 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -setup -through [list csc/cg/tbase/stby/stpst3_reg/N01] -to [list csc/cg/tbase/stby/stpst3_reg/H03] ( _device_scr/d78f1070_chip.scr_101019 L:138 )
define_false_path -through { n:chiptop.chip.csc.cg.tbase.stby.stpst3 } -to { i:chiptop.chip.csc.cg.tbase.stby.stpst3 }

# set_false_path -thr cibc/OPWDEN -to ram0/D* ( _device_scr/d78f1070_chip.scr_101019 L:131 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -setup -from [list cpu/clk/DMA_read_reg/H02] -to $CPUREG ( _device_scr/d78f1070_chip.scr_101019 L:169 )
# define_false_path -from { i:chiptop.chip.cpu.clk.DMA_read } -to { i:chiptop.chip.cpu.alu.*_bank*[*] i:chiptop.chip.cpu.alu.SP_sv[*] i:chiptop.chip.cpu.alu.SP_usr[*] i:chiptop.chip.cpu.alu.IE i:chiptop.chip.cpu.alu.Z i:chiptop.chip.cpu.alu.RBS[*] i:chiptop.chip.cpu.alu.AC i:chiptop.chip.cpu.alu.ISP[*] i:chiptop.chip.cpu.alu.CY i:chiptop.chip.cpu.alu.CS_sv[*] i:chiptop.chip.cpu.alu.CS_usr[*] i:chiptop.chip.cpu.alu.ES_sv[*] i:chiptop.chip.cpu.alu.ES_usr[*] i:chiptop.chip.cpu.alu.MAA }

# set_false_path -setup -through cpu/PA*  -through cibc/nvmchk/EXAmsk_en_o -to flash_cp/CE ( _device_scr/d78f1070_chip.scr_101019 L:146 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -setup -from [list cpu/clk/DMA_read_reg/H02] -through [list cpu/PSELCPU] ( _device_scr/d78f1070_chip.scr_101019 L:165 )
# define_false_path -from { i:chiptop.chip.cpu.clk.DMA_read } -through { n:chiptop.chip.cpu.PSELCPU }

# set_false_path -setup -thr oscmain/*DIN* ( _device_scr/d78f1070_chip.scr_101019 L:107 )
define_false_path -through { n:chiptop.chip.oscmain.*DIN* }

# set_false_path -to flash_data/SCANIN* ( _device_scr/d78f1070_chip.scr_101019 L:102 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -from dmac/main/dmaack_delay_reg_*_/H02 -to cibc/fmop/main_trmlv_bgrtc_clk/clk_gate1/H02 ( _device_scr/d78f1070_chip.scr_101019 L:304 )
define_false_path -from { i:chiptop.chip.dmac.main.dmaack_delay[*] } -to { i:chiptop.chip.cibc.fmop.main.trmlv.bgrtc_clk.clk_gate1 }

# set_false_path -setup -through cpu/PA*  -through cibc/nvmchk/EXAmsk_en_o -to flash_code/EXA ( _device_scr/d78f1070_chip.scr_101019 L:145 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -setup -through [list cpu/DMAMA*] -through [list cpu/PSELCPU] ( _device_scr/d78f1070_chip.scr_101019 L:164 )
# define_false_path -through { n:chiptop.chip.cpu.DMAMA* } -through { n:chiptop.chip.cpu.PSELCPU }

# set_false_path -setup -through [list csc/cg/tbase/stby/stpst3_reg/N01] -to [list csc/cg/tbase/stby/stpst2_reg/H03] ( _device_scr/d78f1070_chip.scr_101019 L:137 )
define_false_path -through { n:chiptop.chip.csc.cg.tbase.stby.stpst3 } -to { i:chiptop.chip.csc.cg.tbase.stby.stpst2 }

# set_false_path -from [get_clock FIHFL] -thr modectl/RDSETUP ( _device_scr/d78f1070_chip.scr_101019 L:98 )
define_false_path -from { c:FIHFL } -through { n:chiptop.chip.modectl.RDSETUP }

# set_false_path -to [list ram0/STN] ( _device_scr/d78f1070_chip.scr_101019 L:126 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -from [get_clocks FCLK]  -to [get_pins cibc/fmop/main_trmlv_iref_ck_mux/clk_gate0/H02] ( _device_scr/d78f1070_chip.scr_101019 L:278 )
define_false_path -from { c:FCLK } -to { i:chiptop.chip.cibc.fmop.main.trmlv_iref_ck_mux.clk_gate0 }

# set_false_path -from pclbuz/main/countm_reg_*_/H02 -thr pclbuz/main/pclsel0_cku_cts/clk_gate1/H01 ( _device_scr/d78f1070_chip.scr_101019 L:284 )
define_false_path -from { i:chiptop.chip.pclbuz.main.countm[*] } -through { n:chiptop.chip.pclbuz.main.pclsel0 }

# set_false_path -setup -from dmac/main/sfr/drs0_reg/H02 -to cibc/fmop/main_trmlv_bgrtc_clk/clk_gate1/H02 ( _device_scr/d78f1070_chip.scr_101019 L:253 )
define_false_path -from { i:chiptop.chip.dmac.main.sfr.drs0 } -to { i:chiptop.chip.cibc.fmop.main.trmlv.bgrtc_clk.clk_gate1 }

# set_false_path -from flash_code/RDCLKC1 -to cibc/fmop/main_trmlv_bgrtc_latch_bgrtc_*/ft3_latch*/H01 ( _device_scr/d78f1070_chip.scr_101019 L:219 )
# Removed because of tool limitation or removed macro on ICE


# set_false_path -setup -through cpu/PA*  -through cibc/nvmchk/EXAmsk_en_o -to flash_code/A* ( _device_scr/d78f1070_chip.scr_101019 L:143 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -from csc/rg/lvictl/main/lvimd_r_1_reg -to csc/rg/lvictl/main/lvimd_p_reg_2_/H03 ( _device_scr/d78f1070_chip.scr_101019 L:300 )
define_false_path -from { i:chiptop.chip.csc.rg.lvictl.main.lvimd_r_1 } -to { i:chiptop.chip.csc.rg.lvictl.main.lvimd_p[2] }

# set_false_path -from [get_clock FIHFL] -thr cibc/RDSETUP ( _device_scr/d78f1070_chip.scr_101019 L:96 )
define_false_path -from { c:FIHFL } -through { n:chiptop.chip.cibc.RDSETUP }

# set_false_path -setup -through [list cpu/DMAMA*] -to $CPUREG ( _device_scr/d78f1070_chip.scr_101019 L:161 )
# define_false_path -through { n:chiptop.chip.cpu.DMAMA* } -to { i:chiptop.chip.cpu.alu.*_bank*[*] i:chiptop.chip.cpu.alu.SP_sv[*] i:chiptop.chip.cpu.alu.SP_usr[*] i:chiptop.chip.cpu.alu.IE i:chiptop.chip.cpu.alu.Z i:chiptop.chip.cpu.alu.RBS[*] i:chiptop.chip.cpu.alu.AC i:chiptop.chip.cpu.alu.ISP[*] i:chiptop.chip.cpu.alu.CY i:chiptop.chip.cpu.alu.CS_sv[*] i:chiptop.chip.cpu.alu.CS_usr[*] i:chiptop.chip.cpu.alu.ES_sv[*] i:chiptop.chip.cpu.alu.ES_usr[*] i:chiptop.chip.cpu.alu.MAA }

# set_false_path -to flash_code/SCANIN* ( _device_scr/d78f1070_chip.scr_101019 L:101 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -from pclbuz/main/counts_reg_*_/H02 -thr pclbuz/main/pclsel1_cku_cts/clk_gate1/H01 ( _device_scr/d78f1070_chip.scr_101019 L:289 )
define_false_path -from { i:chiptop.chip.pclbuz.main.counts[*] } -through { n:chiptop.chip.pclbuz.main.pclsel1 }

# set_false_path -from csc/rg/lvictl/main/lvimd_r_1_reg -to csc/rg/lvictl/main/lvimd_p_reg_1_/H03 ( _device_scr/d78f1070_chip.scr_101019 L:299 )
define_false_path -from { i:chiptop.chip.csc.rg.lvictl.main.lvimd_r_1 } -to { i:chiptop.chip.csc.rg.lvictl.main.lvimd_p[1] }

# set_false_path -setup -from cibc/fmop/main_trmlv_bgrtc_latch_bgrtc_*/ft3_latch*/H01 -thr cibc/PRDATA* ( _device_scr/d78f1070_chip.scr_101019 L:233 )
define_false_path -from { i:chiptop.chip.cibc.fmop.main.trmlv.bgrtc_latch_bgrtc_*.ft3_latch*.DLSFQ2_inst.LDCPE_inst } -through { n:chiptop.chip.cibc.PRDATA* }

# set_false_path -thr cibc/CSPDTFLG -to ram0/D* ( _device_scr/d78f1070_chip.scr_101019 L:132 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -from [get_clocks FCLK]  -to [get_pins cibc/fmop/main_trmlv_vread_ck_mux/clk_gate0/H02] ( _device_scr/d78f1070_chip.scr_101019 L:279 )
define_false_path -from { c:FCLK } -to { i:chiptop.chip.cibc.fmop.main.trmlv_vread_ck_mux.clk_gate0 }

# set_false_path -from dmac/main/dmaack_delay_reg_*_/H02 -to cibc/fmop/main_trmlv_bgrt_clk/clk_gate1/H02 ( _device_scr/d78f1070_chip.scr_101019 L:305 )
define_false_path -from { i:chiptop.chip.dmac.main.dmaack_delay[*] } -to { i:chiptop.chip.cibc.fmop.main.trmlv.bgrt_clk.clk_gate1 }

# set_false_path -from [all_clocks] -to [all_clocks] ( _device_scr/d78f1070_chip.scr_101019 L:69 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -setup -from [list cpu/clk/DMA_write_reg/H02] -through [list cpu/PSELCPU] ( _device_scr/d78f1070_chip.scr_101019 L:166 )
# define_false_path -from { i:chiptop.chip.cpu.clk.DMA_write } -through { n:chiptop.chip.cpu.PSELCPU }

# set_false_path -setup -thr port*_iobuf*/iobuf*/DIN* ( _device_scr/d78f1070_chip.scr_101019 L:106 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -setup -through [list modectl/TESENI*] -through [list port*/TDIN*] ( _device_scr/d78f1070_chip.scr_101019 L:200 )
define_false_path -through { n:chiptop.chip.TESENI* } -through { n:chiptop.chip.TDIN* }

# set_false_path -from [all_inputs] ( _device_scr/d78f1070_chip.scr_101019 L:86 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -setup -from cibc/fmop/main_fmopb_wdton_ft3_cap_bit_* -through ramif/GDRAMWR -to ram0/BUN ( _device_scr/d78f1070_chip.scr_101019 L:251 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -setup -through [list modectl/TESENI*] -through [list port*/PRDATA*] ( _device_scr/d78f1070_chip.scr_101019 L:198 )
define_false_path -through { n:chiptop.chip.TESENI* } -through { n:chiptop.chip.port*.PRDATA* }

# set_false_path -from [get_clocks SCANCLK] -to [all_clocks] ( _device_scr/d78f1070_clock.scr_32MHz_30ns L:161 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -setup -thr oscsub/*DIN* ( _device_scr/d78f1070_chip.scr_101019 L:108 )
define_false_path -through { n:chiptop.chip.oscsub.*DIN* }

# set_false_path -setup -through cpu/PA*  -through cibc/nvmchk/ce0msk_en_o -to flash_code/CE ( _device_scr/d78f1070_chip.scr_101019 L:148 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -setup -from dmac/main/sfr/drs0_reg/H02 -to cibc/fmop/main_trmlv_bgrt_clk/clk_gate1/H02 ( _device_scr/d78f1070_chip.scr_101019 L:252 )
define_false_path -from { i:chiptop.chip.dmac.main.sfr.drs0 } -to { i:chiptop.chip.cibc.fmop.main.trmlv.bgrt_clk.clk_gate1 }

# set_false_path -from flash_code/RDCLKC1 -to cibc/fmop/main_trmlv_bgrt_latch_bgrt_*/ft3_latch*/H01 ( _device_scr/d78f1070_chip.scr_101019 L:220 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -setup -through cpu/PA*  -through cibc/nvmchk/EXAmsk_en_o -to flash_code/CE ( _device_scr/d78f1070_chip.scr_101019 L:144 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -setup -through cpu/PA*  -through cibc/nvmchk/ce0msk_en_o -to flash_cp/CE ( _device_scr/d78f1070_chip.scr_101019 L:149 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -from pclbuz/main/counts_reg_*_/H02 -thr pclbuz/main/pclsel0_cku_cts/clk_gate1/H01 ( _device_scr/d78f1070_chip.scr_101019 L:285 )
define_false_path -from { i:chiptop.chip.pclbuz.main.counts[*] } -through { n:chiptop.chip.pclbuz.main.pclsel0 }

# set_false_path -setup -through [list csc/cg/tbase/stby/stpst3_reg/N01] -to [list csc/cg/tbase/stby/stpst1_reg/H03] ( _device_scr/d78f1070_chip.scr_101019 L:136 )
define_false_path -through { n:chiptop.chip.csc.cg.tbase.stby.stpst3 } -to { i:chiptop.chip.csc.cg.tbase.stby.stpst1 }

# set_false_path -setup -from cibc/fmop/main_trmlv_bgrt_latch_bgrt_*/ft3_latch*/H01   -thr cibc/PRDATA* ( _device_scr/d78f1070_chip.scr_101019 L:234 )
define_false_path -from { i:chiptop.chip.cibc.fmop.main.trmlv.bgrt_latch_bgrt_*.ft3_latch*.DLSFQ2_inst.LDCPE_inst } -through { n:chiptop.chip.cibc.PRDATA* }

# set_false_path -setup -from [list cpu/clk/DMA_write_reg/H02] -to $CPUREG ( _device_scr/d78f1070_chip.scr_101019 L:170 )
# define_false_path -from { i:chiptop.chip.cpu.clk.DMA_write } -to { i:chiptop.chip.cpu.alu.*_bank*[*] i:chiptop.chip.cpu.alu.SP_sv[*] i:chiptop.chip.cpu.alu.SP_usr[*] i:chiptop.chip.cpu.alu.IE i:chiptop.chip.cpu.alu.Z i:chiptop.chip.cpu.alu.RBS[*] i:chiptop.chip.cpu.alu.AC i:chiptop.chip.cpu.alu.ISP[*] i:chiptop.chip.cpu.alu.CY i:chiptop.chip.cpu.alu.CS_sv[*] i:chiptop.chip.cpu.alu.CS_usr[*] i:chiptop.chip.cpu.alu.ES_sv[*] i:chiptop.chip.cpu.alu.ES_usr[*] i:chiptop.chip.cpu.alu.MAA }

# set_false_path -from [get_clock FIHFL] -thr cibd/RDSETUP ( _device_scr/d78f1070_chip.scr_101019 L:97 )
define_false_path -from { c:FIHFL } -through { n:chiptop.chip.cibd.RDSETUP }

# set_false_path -from csc/rg/lvictl/main/lvimd_r_2_reg -to csc/rg/lvictl/main/lvimd_p_reg_2_/H03 ( _device_scr/d78f1070_chip.scr_101019 L:296 )
define_false_path -from { i:chiptop.chip.csc.rg.lvictl.main.lvimd_r_2 } -to { i:chiptop.chip.csc.rg.lvictl.main.lvimd_p[2] }


# set_false_path -from porga/main/regctl_prdsel_ramcnf_reg_*_/H02  -to ram0/D* ( _device_scr/d78f1070_chip.scr_101019 L:306 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -from csc/rg/lvictl/main/lvimd_r_1_reg -to csc/rg/lvictl/main/lvimd_p_reg_0_/H03 ( _device_scr/d78f1070_chip.scr_101019 L:298 )
define_false_path -from { i:chiptop.chip.csc.rg.lvictl.main.lvimd_r_1 } -to { i:chiptop.chip.csc.rg.lvictl.main.lvimd_p[0] }

# set_false_path -from csc/rg/lvictl/main/lvimd_r_2_reg -to csc/rg/lvictl/main/lvimd_p_reg_1_/H03 ( _device_scr/d78f1070_chip.scr_101019 L:295 )
define_false_path -from { i:chiptop.chip.csc.rg.lvictl.main.lvimd_r_2 } -to { i:chiptop.chip.csc.rg.lvictl.main.lvimd_p[1] }

# set_false_path -from pclbuz/main/countm_reg_*_/H02 -thr pclbuz/main/pclsel1_cku_cts/clk_gate1/H01 ( _device_scr/d78f1070_chip.scr_101019 L:288 )
define_false_path -from { i:chiptop.chip.pclbuz.main.countm[*] } -through { n:chiptop.chip.pclbuz.main.pclsel1 }




#
#  Unrecognized Attribute List
#



#
#  UnAnalized Attribute List
#

# set_disable_timing [get_pins    int48/main/sfrreg/IFREG28/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:670)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG9/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:696)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG11/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:652)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG15/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:656)
# set_disable_timing [get_pins    csc/rg/lvictl/main/lvilv_set_mux/clk_gate0/H01] ( _device_scr/d78f1070_chip.scr_101019 L:630)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG46/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:690)
# set_disable_timing [get_pins    adctl/core/wup/U10/H02]  ( _device_scr/d78f1070_chip.scr_101019 L:641)
# set_disable_timing [get_pins    iica/sub/U56/H01] ( _device_scr/d78f1070_chip.scr_101019 L:618)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG30/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:673)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG34/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:677)
# set_disable_timing [get_pins    csc/rg/resctl_main/resf_reg_wr/gate_sel12/selgate/H02] ( _device_scr/d78f1070_chip.scr_101019 L:634)
# set_disable_timing [get_pins  pclbuz/main/pclsel1_cku_cts/clk_gate0/H01] ( _device_scr/d78f1070_chip.scr_101019 L:604)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG16/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:657)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG47/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:691)
# set_disable_timing [get_pins modectl/GOFIRM]  ( _device_scr/d78f1070_chip.scr_101019 L:192)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG17/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:658)
# set_disable_timing [get_pins  pclbuz/main/pclsel0_cku_cts/clk_gate0/H01] ( _device_scr/d78f1070_chip.scr_101019 L:601)
# set_disable_timing [get_pins    csc/rg/resctl_main/gate_sel1/selgate/H02] ( _device_scr/d78f1070_chip.scr_101019 L:625)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG35/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:678)
# set_disable_timing [get_pins  ocd/main/uart/uart_bcounter/U6/H02] ( _device_scr/d78f1070_chip.scr_101019 L:608)
# set_disable_timing [get_pins  csc/cg/pec/intrclk_p_mux/clk_gate1/H01] ( _device_scr/d78f1070_chip.scr_101019 L:621)
# set_disable_timing [get_pins  ocd/main/uart/uart_bcounter/U5/H02] ( _device_scr/d78f1070_chip.scr_101019 L:607)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG23/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:665)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG0/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:649)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG36/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:679)
# set_disable_timing [get_pins  ocd/main/uart/uart_int_edge_U6/H02] ( _device_scr/d78f1070_chip.scr_101019 L:609)
# set_disable_timing [get_pins    csc/rg/resctl_main/resf_reg_wr/gate_sel13/selgate/H02] ( _device_scr/d78f1070_chip.scr_101019 L:635)
# set_disable_timing [get_pins modectl/GOFIRMR] ( _device_scr/d78f1070_chip.scr_101019 L:193)
# set_disable_timing [list intm4/EGIN*] ( _device_scr/d78f1070_chip.scr_101019 L:205)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG6/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:693)
# set_disable_timing [get_pins  csc/cg/hioscctl/fmain_sel/fih_p1_cts/clk_gate0/H01] ( _device_scr/d78f1070_chip.scr_101019 L:583)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG24/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:666)
# set_disable_timing [get_pins    csc/rg/resctl_main/resf_reg_wr/gate_sel20/selgate/H02] ( _device_scr/d78f1070_chip.scr_101019 L:637)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG5/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:692)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG42/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:686)
# set_disable_timing  modectl/modectl_tport/U254 -from H01 -to N01  ( _device_scr/d78f1070_chip.scr_101019 L:188)
# set_disable_timing [get_pins  ocd/main/uart/uart_wetx2_U5/H02] ( _device_scr/d78f1070_chip.scr_101019 L:610)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG12/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:653)
# set_disable_timing [get_pins l_rosc/LOSCOUT] ( _device_scr/d78f1070_chip.scr_101019 L:112)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG25/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:667)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG29/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:671)
# set_disable_timing [get_pins    csc/rg/lvictl/counter/fil15kin_mux/clk_gate0/H01] ( _device_scr/d78f1070_chip.scr_101019 L:628)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG7/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:694)
# set_disable_timing [get_pins  csc/rg/lvictl/counter/fil15kin_mux/clk_gate0/H01] ( _device_scr/d78f1070_chip.scr_101019 L:598)
# set_disable_timing [get_pins  csc/cg/pec/wdttesck_mux/clk_gate1/H01] ( _device_scr/d78f1070_chip.scr_101019 L:622)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG13/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:654)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG43/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:687)
# set_disable_timing [get_pins  csc/cg/tbase/fclk_cts/clk_gate0/H01] ( _device_scr/d78f1070_chip.scr_101019 L:580)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG44/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:688)
# set_disable_timing [get_pins    csc/rg/lvictl/counter/reqlvi_set_mux/clk_gate0/H01] ( _device_scr/d78f1070_chip.scr_101019 L:629)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG31/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:674)
# set_disable_timing [get_pins    csc/rg/lvictl/main/lviomsk_set_mux/clk_gate0/H01] ( _device_scr/d78f1070_chip.scr_101019 L:631)
# set_disable_timing [get_pins    csc/rg/resctl_main/resf_reg_wr/gate_sel11/selgate/H02] ( _device_scr/d78f1070_chip.scr_101019 L:633)
# set_disable_timing [get_pins    csc/rg/resctl_main/resf_reg_wr/gate_sel23/selgate/H02] ( _device_scr/d78f1070_chip.scr_101019 L:638)
# set_disable_timing [get_pins  csc/cg/mosccnt/fmx4_cts/clk_gate0/H01] ( _device_scr/d78f1070_chip.scr_101019 L:592)
# set_disable_timing [get_pins    csc/rg/lvictl/counter/count_clock_mux/clk_gate0/H01] ( _device_scr/d78f1070_chip.scr_101019 L:627)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG14/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:655)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG18/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:659)
# set_disable_timing [get_pins    csc/rg/resctl_main/resf_reg_wr/gate_sel19/selgate/H02] ( _device_scr/d78f1070_chip.scr_101019 L:636)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG19/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:660)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG45/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:689)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG32/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:675)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG37/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:680)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG1/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:650)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG33/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:676)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG20/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:662)
# set_disable_timing [list port7/INTKR] ( _device_scr/d78f1070_chip.scr_101019 L:206)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG21/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:663)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREGDBG/U8/H01] ( _device_scr/d78f1070_chip.scr_101019 L:698)
# set_disable_timing [get_pins  csc/cg/hioscctl/fmain_sel/tclkfih_mux/clk_gate0/H01] ( _device_scr/d78f1070_chip.scr_101019 L:587)
# set_disable_timing [get_pins  pclbuz/fsub_cts/clk_gate0/H01] ( _device_scr/d78f1070_chip.scr_101019 L:595)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG2/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:661)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG38/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:681)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG26/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:668)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG39/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:682)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG22/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:664)
# set_disable_timing [get_pins  pclbuz/fmain_cts/clk_gate0/H01] ( _device_scr/d78f1070_chip.scr_101019 L:584)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG3/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:672)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG40/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:684)
# set_disable_timing [list intm8/EGIN*] ( _device_scr/d78f1070_chip.scr_101019 L:204)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG10/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:651)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG8/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:695)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG41/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:685)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG27/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:669)
# set_disable_timing [get_pins    int48/main/sfrreg/IFREG4/U10/H01] ( _device_scr/d78f1070_chip.scr_101019 L:683)


#
#  UnConverted Attribute List
#

# create_generated_clock -name DRDCLK -source [get_pins csc/cg/tbase/fclk_cts/root/N01]  -divide_by 2 [get_pins cpu/adr_drdclk_reg/N01] ( _device_scr/d78f1070_clock.scr_32MHz_30ns L:146)
# set_multicycle_path 1 -hold  -from csc/cg/tbase/stby/resbgen/nsresb_reg/H02 -to csc/cg/tbase/stby/hltst1_neg_reg/H03 ( _device_scr/d78f1070_chip.scr_101019 L:255)
# set_multicycle_path 1 -hold -thr cpu/HLTST -thr modectl/SELTAF -thr cibc/SELTAF ( _device_scr/d78f1070_chip.scr_101019 L:184)
# set_multicycle_path 1 -hold  -end  -through  [get_pins [list fcb/ONBD fcb/FLMEMTES fcb/ICENOECC fcb/ICEFLERR fcb/TFWEPR fcb/SCANMODE]] ( _device_scr/d78f1070_chip.scr_101019 L:175)
# set_max_time_borrow 0.0 [get_pins cibc/fmop/main_trmlv_bgrt_latch_bgrt_*/ft3_latch*/H02] ( _device_scr/d78f1070_chip.scr_101019 L:215)
# set_max_time_borrow 0.0 [get_pins cibc/fmop/main_trmlv_bgrtc_latch_bgrtc_*/ft3_latch*/H02] ( _device_scr/d78f1070_chip.scr_101019 L:214)
# set_false_path -setup -fall_thr bbr/PENABLE -thr */PRDATA* -thr cpu/MDR* ( _device_scr/d78f1070_chip.scr_101019 L:118)
# set_false_path -setup -rise_thr bbr/PWRITE -thr */PRDATA* -thr cpu/MDR* ( _device_scr/d78f1070_chip.scr_101019 L:117)
