##################################################
##
## Constraint file for Synplify Pro
##   Generated by FICE(mksdc) ver 0.9.152
##   time : Fri Dec 03 14:34:50 +0900 2010
##
##################################################

####  Use Following File(s) ####
# _device_scr/_plug/d78f2004_chip_plug.scr_101116
# _device_scr/_plug/d78f2004_clock_plug.scr_101022
# _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124
# _device_scr/_plug/d78f2004_mode_plug.scr_101020
# _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr

#
#  Constraint for ICE Macro
#

#  doesnt generate because mksdc executed under "-constant off" option.



#
#  create_clock
#


# create_clock -name BBMOSC   [get_pins bbif/bbif_rep/rep_CLKI01/U1/N01] -period  $BBTclk  ( _device_scr/_plug/d78f2004_clock_plug.scr_101022 L:90 )
# Removed because of tool limitation or removed macro on ICE

# create_clock -name BBHIOSC  [get_pins bbif/bbif_rep/rep_CLKI02/U1/N01] -period  $BBTclk  ( _device_scr/_plug/d78f2004_clock_plug.scr_101022 L:91 )
# Removed because of tool limitation or removed macro on ICE

# create_clock -name BBSCANCLK  [get_pins scanctl/scanclk_gate/N01]  -period $BBSclk ( _device_scr/_plug/d78f2004_clock_plug.scr_101022 L:96 )
# Removed because of tool limitation or removed macro on ICE

# create_clock -name BBFCLKDS [get_pins pllctl/pllc/optexcck_mux/root/N01] -period  $BBTclk_dspo  ( _device_scr/_plug/d78f2004_clock_plug.scr_101022 L:86 )
define_clock { n:chiptop.chip.pllctl.pllc.fclkds } -name { BBFCLKDS } -period 14.5 -clockgroup FCLK -route 0.000

# create_clock -name BBFCLK   [get_pins bbif/bbif_rep/rep_CLKI05/U1/N01] -period  $BBTclk  ( _device_scr/_plug/d78f2004_clock_plug.scr_101022 L:82 )
# Removed because of tool limitation or removed macro on ICE

# create_clock -name BBSCANCLK2 [get_pins bbif/bbif_rep/rep_CLKI07/U1/N01]       -period $BBSclk_dspo ( _device_scr/_plug/d78f2004_clock_plug.scr_101022 L:97 )
# Removed because of tool limitation or removed macro on ICE





#
#  set_dont_touch
#


# set_dont_touch "pllctl/pec/dsper0_gate" ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:176 )
define_attribute { i:chiptop.chip.pllctl.pec.dsper0_gate.* } syn_keep { 1 }

# set_dont_touch "pllctl/pec/dsper4_gate" ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:172 )
define_attribute { i:chiptop.chip.pllctl.pec.dsper4_gate.* } syn_keep { 1 }

# set_dont_touch "cg/pec/cpu_gate" ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:157 )
define_attribute { i:chiptop.chip.cg.pec.cpu_gate.* } syn_keep { 1 }

# set_dont_touch [list pllctl/pllc/fr_div/cksel_fr_mux/*] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:141 )
define_attribute { i:chiptop.chip.pllctl.pllc.fr_div.cksel_fr_mux.*.* } syn_keep { 1 }

# set_dont_touch TESTO0 ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:39 )
define_attribute { i:chiptop.chip.TESTO0.* } syn_keep { 1 }

# set_dont_touch "cg/pec/per14_gate" ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:161 )
define_attribute { i:chiptop.chip.cg.pec.per14_gate.* } syn_keep { 1 }

# set_dont_touch "cg/pec/per10_gate" ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:165 )
define_attribute { i:chiptop.chip.cg.pec.per10_gate.* } syn_keep { 1 }

# set_dont_touch TESTO1 ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:41 )
define_attribute { i:chiptop.chip.TESTO1.* } syn_keep { 1 }

# set_dont_touch "pllctl/pec/dsper7_gate" ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:169 )
define_attribute { i:chiptop.chip.pllctl.pec.dsper7_gate.* } syn_keep { 1 }

# set_dont_touch [list dsbbr/trgctl_trgdly2/*] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:26 )
define_attribute { i:chiptop.chip.dsbbr.trgctl_trgdly2.*.* } syn_keep { 1 }

# set_dont_touch [list pllctl/pllc/outselm_mux/*] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:131 )
define_attribute { i:chiptop.chip.pllctl.pllc.outselm_mux.*.* } syn_keep { 1 }

# set_dont_touch BBFMAINOR ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:52 )
define_attribute { i:chiptop.chip.BBFMAINOR.* } syn_keep { 1 }

# set_dont_touch "cg/pec/per17_gate" ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:158 )
define_attribute { i:chiptop.chip.cg.pec.per17_gate.* } syn_keep { 1 }

# set_dont_touch bbif/BBFILOR ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:62 )
define_attribute { i:chiptop.chip.bbif.BBFILOR.* } syn_keep { 1 }

# set_dont_touch BBFCLKOR ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:58 )
define_attribute { i:chiptop.chip.BBFCLKOR.* } syn_keep { 1 }

# set_dont_touch pull_down15 ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:198 )
define_attribute { i:chiptop.chip.pull_down15.* } syn_keep { 1 }

# set_dont_touch bbif/BBMOSCOR ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:47 )
define_attribute { i:chiptop.chip.bbif.BBMOSCOR.* } syn_keep { 1 }

# set_dont_touch [list pllctl/pllc/bbclk_div/cksel_ds2_ds4/clk1_gate] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:143 )
define_attribute { i:chiptop.chip.pllctl.pllc.bbclk_div.cksel_ds2_ds4.clk1_gate.* } syn_keep { 1 }

# set_dont_touch [get_nets port20_iobuf/TESTO0] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:96 )
define_attribute { i:chiptop.chip.port20_iobuf.TESTO0.* } syn_keep { 1 }

# set_dont_touch cmp_pga ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:10 )
define_attribute { i:chiptop.chip.cmp_pga.* } syn_keep { 1 }

# set_dont_touch "pllctl/pec/dsper1_gate" ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:175 )
define_attribute { i:chiptop.chip.pllctl.pec.dsper1_gate.* } syn_keep { 1 }

# set_dont_touch "pllctl/pec/dsprsu_gate" ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:178 )
define_attribute { i:chiptop.chip.pllctl.pec.dsprsu_gate.* } syn_keep { 1 }

# set_dont_touch "cg/pec/per11_gate" ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:164 )
define_attribute { i:chiptop.chip.cg.pec.per11_gate.* } syn_keep { 1 }

# set_dont_touch [list pllctl/pllc/insel_mux/*] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:126 )
define_attribute { i:chiptop.chip.pllctl.pllc.insel_mux.*.* } syn_keep { 1 }

# set_dont_touch pll ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:9 )
define_attribute { i:chiptop.chip.pll.* } syn_keep { 1 }

# set_dont_touch SELIN1B5VOR ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:71 )
define_attribute { i:chiptop.chip.SELIN1B5VOR.* } syn_keep { 1 }

# set_dont_touch [list bbif/bbif_rep/ice_08pin] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:32 )
define_attribute { i:chiptop.chip.bbif.bbif_rep.ice_08pin.* } syn_keep { 1 }

# set_dont_touch [list dsbbr/trgctl_trgdly3/*] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:27 )
define_attribute { i:chiptop.chip.dsbbr.trgctl_trgdly3.*.* } syn_keep { 1 }

# set_dont_touch BBFSUBOR ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:55 )
define_attribute { i:chiptop.chip.BBFSUBOR.* } syn_keep { 1 }

# set_dont_touch "pllctl/pec/dspclkrw_gate" ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:177 )
define_attribute { i:chiptop.chip.pllctl.pec.dspclkrw_gate.* } syn_keep { 1 }

# set_dont_touch FO ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:65 )
define_attribute { i:chiptop.chip.FO.* } syn_keep { 1 }

# set_dont_touch [get_nets port20_iobuf/SELIN1B5V] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:72 )
define_attribute { i:chiptop.chip.port20_iobuf.SELIN1B5V.* } syn_keep { 1 }

# set_dont_touch [list pllctl/pllc/optexcck_mux/*] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:128 )
define_attribute { i:chiptop.chip.pllctl.pllc.optexcck_mux.*.* } syn_keep { 1 }

# set_dont_touch BBHIOSCOR ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:49 )
define_attribute { i:chiptop.chip.BBHIOSCOR.* } syn_keep { 1 }

# set_dont_touch [get_nets TESTO0] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:95 )
define_attribute { i:chiptop.chip.TESTO0.* } syn_keep { 1 }

# set_dont_touch [list pllctl/pllc/scanclk_mux/*] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:132 )
define_attribute { i:chiptop.chip.pllctl.pllc.scanclk_mux.*.* } syn_keep { 1 }

# set_dont_touch [list bbif/bbif_rep/rep_*] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:31 )
define_attribute { i:chiptop.chip.bbif.bbif_rep.rep_*.* } syn_keep { 1 }

# set_dont_touch "pllctl/pec/dsper2_gate" ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:174 )
define_attribute { i:chiptop.chip.pllctl.pec.dsper2_gate.* } syn_keep { 1 }

# set_dont_touch "cg/pec/port_gate" ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:156 )
define_attribute { i:chiptop.chip.cg.pec.port_gate.* } syn_keep { 1 }

# set_dont_touch [list pllctl/pllc/bbclk_div/cksel_ds2_ds4/clk2_gate] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:144 )
define_attribute { i:chiptop.chip.pllctl.pllc.bbclk_div.cksel_ds2_ds4.clk2_gate.* } syn_keep { 1 }

# set_dont_touch [list intm4/main/intp*_dfil] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:108 )
define_attribute { i:chiptop.chip.intm4.main.intp*_dfil.* } syn_keep { 1 }

# set_dont_touch dmya ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:183 )
define_attribute { i:chiptop.chip.dmya.* } syn_keep { 1 }

# set_dont_touch BBMOSCOR ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:46 )
define_attribute { i:chiptop.chip.BBMOSCOR.* } syn_keep { 1 }

# set_dont_touch "cg/pec/per12_gate" ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:163 )
define_attribute { i:chiptop.chip.cg.pec.per12_gate.* } syn_keep { 1 }

# set_dont_touch [list pllctl/pllc/bbclk_div/cksel_ds2_ds4/clk_gate] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:145 )
define_attribute { i:chiptop.chip.pllctl.pllc.bbclk_div.cksel_ds2_ds4.clk_gate.* } syn_keep { 1 }

# set_dont_touch [list pllctl/pllc/bbclk_div/cksel_ds8_mux/*] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:142 )
define_attribute { i:chiptop.chip.pllctl.pllc.bbclk_div.cksel_ds8_mux.*.* } syn_keep { 1 }

# set_dont_touch [list pllctl/pllc/outselr_mux/*] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:130 )
define_attribute { i:chiptop.chip.pllctl.pllc.outselr_mux.*.* } syn_keep { 1 }

# set_dont_touch dmyb ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:184 )
define_attribute { i:chiptop.chip.dmyb.* } syn_keep { 1 }

# set_dont_touch "pllctl/pec/dsper5_gate" ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:171 )
define_attribute { i:chiptop.chip.pllctl.pec.dsper5_gate.* } syn_keep { 1 }

# set_dont_touch bbif/BBFCLKOR ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:59 )
define_attribute { i:chiptop.chip.bbif.BBFCLKOR.* } syn_keep { 1 }

# set_dont_touch dmyc ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:185 )
define_attribute { i:chiptop.chip.dmyc.* } syn_keep { 1 }

# set_dont_touch [get_nets port20_iobuf/TESTO1] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:98 )
define_attribute { i:chiptop.chip.port20_iobuf.TESTO1.* } syn_keep { 1 }

# set_dont_touch "cg/pec/per15_gate" ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:160 )
define_attribute { i:chiptop.chip.cg.pec.per15_gate.* } syn_keep { 1 }

# set_dont_touch dmyd ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:186 )
define_attribute { i:chiptop.chip.dmyd.* } syn_keep { 1 }

# set_dont_touch pllctl/pllc/fo ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:66 )
define_attribute { i:chiptop.chip.pllctl.pllc.fo.* } syn_keep { 1 }

# set_dont_touch BBFILOR ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:61 )
define_attribute { i:chiptop.chip.BBFILOR.* } syn_keep { 1 }

# set_dont_touch bbif/BBFSUBOR ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:56 )
define_attribute { i:chiptop.chip.bbif.BBFSUBOR.* } syn_keep { 1 }

# set_dont_touch [list porga/intctl/fil_intp20/delay1] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:103 )
define_attribute { i:chiptop.chip.porga.intctl.fil_intp20.delay1.* } syn_keep { 1 }

# set_dont_touch [list pllctl/pllc/fo_mux/*] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:129 )
define_attribute { i:chiptop.chip.pllctl.pllc.fo_mux.*.* } syn_keep { 1 }

# set_dont_touch [list porga/intctl/fil_intp21/delay1] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:104 )
define_attribute { i:chiptop.chip.porga.intctl.fil_intp21.delay1.* } syn_keep { 1 }

# set_dont_touch "pllctl/pec/dsper3_gate" ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:173 )
define_attribute { i:chiptop.chip.pllctl.pec.dsper3_gate.* } syn_keep { 1 }

# set_dont_touch "cg/pec/prsu_gate" ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:167 )
define_attribute { i:chiptop.chip.cg.pec.prsu_gate.* } syn_keep { 1 }

# set_dont_touch [list intm4/main/intp*_edge] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:107 )
define_attribute { i:chiptop.chip.intm4.main.intp*_edge.* } syn_keep { 1 }

# set_dont_touch pull_down26 ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:203 )
define_attribute { i:chiptop.chip.pull_down26.* } syn_keep { 1 }

# set_dont_touch "cg/pec/per13_gate" ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:162 )
define_attribute { i:chiptop.chip.cg.pec.per13_gate.* } syn_keep { 1 }

# set_dont_touch bbif/BBHIOSCOR ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:50 )
define_attribute { i:chiptop.chip.bbif.BBHIOSCOR.* } syn_keep { 1 }

# set_dont_touch [list dsbbr/trgctl_trgdly1/*] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:25 )
define_attribute { i:chiptop.chip.dsbbr.trgctl_trgdly1.*.* } syn_keep { 1 }

# set_dont_touch bbif/BBFMAINOR ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:53 )
define_attribute { i:chiptop.chip.bbif.BBFMAINOR.* } syn_keep { 1 }

# set_dont_touch "pllctl/pec/dsper6_gate" ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:170 )
define_attribute { i:chiptop.chip.pllctl.pec.dsper6_gate.* } syn_keep { 1 }

# set_dont_touch [get_nets TESTO1] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:97 )
define_attribute { i:chiptop.chip.TESTO1.* } syn_keep { 1 }

# set_dont_touch port20_iobuf/* ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:42 )
define_attribute { i:chiptop.chip.port20_iobuf.*.* } syn_keep { 1 }

# set_dont_touch "cg/pec/per16_gate" ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:159 )
define_attribute { i:chiptop.chip.cg.pec.per16_gate.* } syn_keep { 1 }

# set_dont_touch "cg/pec/pclkrw_gate" ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:166 )
define_attribute { i:chiptop.chip.cg.pec.pclkrw_gate.* } syn_keep { 1 }

# set_dont_touch [list pllctl/pllc/frsel_mux/*] ( _device_scr/_plug/d78f2004_dont_touch_plug.scr_101124 L:127 )
define_attribute { i:chiptop.chip.pllctl.pllc.frsel_mux.*.* } syn_keep { 1 }





#
#  set_case_analysis
#


# set_case_analysis 0 [get_pins socket/TESDBT2OR] ( _device_scr/_plug/d78f2004_mode_plug.scr_101020 L:27 )
define_attribute { t:chiptop.chip.socket.TESDBT2OR } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins socket/OPTIDDQOR] ( _device_scr/_plug/d78f2004_mode_plug.scr_101020 L:23 )
define_attribute { t:chiptop.chip.socket.OPTIDDQOR } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins socket/BBTESSCAN1OR] ( _device_scr/_plug/d78f2004_mode_plug.scr_101020 L:17 )
define_attribute { t:chiptop.chip.socket.BBTESSCAN1OR } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins socket/SCANENOR] ( _device_scr/_plug/d78f2004_mode_plug.scr_101020 L:11 )
define_attribute { t:chiptop.chip.socket.SCANENOR } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins socket/BBTESINSTOR] ( _device_scr/_plug/d78f2004_mode_plug.scr_101020 L:20 )
define_attribute { t:chiptop.chip.socket.BBTESINSTOR } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins socket/SCANMODEOR] ( _device_scr/_plug/d78f2004_mode_plug.scr_101020 L:14 )
define_attribute { t:chiptop.chip.socket.SCANMODEOR } xc_pulldown { 1 }

# set_case_analysis 0 [get_pins socket/TESDBTOR] ( _device_scr/_plug/d78f2004_mode_plug.scr_101020 L:26 )
define_attribute { t:chiptop.chip.socket.TESDBTOR } xc_pulldown { 1 }





#
#  set_min_delay
#










#
#  reset_path
#


# reset_path -from $CLOCK -to $CLOCK ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:12 )
# Unconvert constraint

# reset_path -from BBFCLK   -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:17 )
# Unconvert constraint

# reset_path -from BBFCLKDS -to BBFCLK ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:16 )
# Unconvert constraint





#
#  set_max_delay
#


# set_max_delay 11 -from socket/BBSELSFR2OR -to socket/BBPRDATA* ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:85 )
# define_max_delay -from { i:chiptop.chip.socket.BBSELSFR2OR } -to { i:chiptop.chip.socket.BBPRDATA* } { 11 } # comment out( Customize for ICE )

# set_max_delay 11 -from socket/BBPWRITEOR  -to socket/BBPRDATA* ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:86 )
# define_max_delay -from { i:chiptop.chip.socket.BBPWRITEOR } -to { i:chiptop.chip.socket.BBPRDATA* } { 11 } # comment out( Customize for ICE )

# set_max_delay 11 -from socket/BBMA*       -to socket/BBPRDATA* ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:84 )
# define_max_delay -from { i:chiptop.chip.socket.BBMA* } -to { i:chiptop.chip.socket.BBPRDATA* } { 11 } # comment out( Customize for ICE )

# set_max_delay 11 -from socket/BBPENABLEOR -to socket/BBPRDATA* ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:87 )
# define_max_delay -from { i:chiptop.chip.socket.BBPENABLEOR } -to { i:chiptop.chip.socket.BBPRDATA* } { 11 } # comment out( Customize for ICE )





#
#  set_multicycle_path
#


# set_multicycle_path 1 -hold  -from BBFCLK -thr [list socket/BBMA*] -thr [list socket/BBPRDATA*] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:86 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 2 -setup -from BBFCLKDS -thr [list dsbbr/PRDCMP*] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:53 )
# define_multicycle_path -from { c:BBFCLKDS } -through { n:chiptop.chip.dsbbr.PRDCMP* } -to { c:BBFCLK } { 2 } # force changed
define_multicycle_path -from { c:BBFCLKDS } -through { n:chiptop.chip.dsbbr.PRDCMP* } -to { c:FCLK } { 2 }

# set_multicycle_path 1 -hold  -from BBFCLK -thr [list socket/BBMA*] -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:40 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 2 -setup -from BBFCLK -thr [list socket/BBPWRITEOR] -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:43 )
# define_multicycle_path -from { c:BBFCLK } -through { n:chiptop.chip.socket.BBPWRITEOR } -to { c:BBFCLKDS } { 2 } # force changed
define_multicycle_path -from { c:FCLK } -through { n:chiptop.chip.socket.BBPWRITEOR } -to { c:BBFCLKDS } { 2 }

# set_multicycle_path 1 -hold  -from BBFCLK -thr [list socket/BBMA*] -to dsbbr/apbctl_prdds_pre_reg_*_/H01 ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:116 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 2 -setup -from BBFCLK -thr [list porga/CK*TM] -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:127 )
# define_multicycle_path -from { c:BBFCLK } -through { n:chiptop.chip.porga.CK*TM } -to { c:BBFCLKDS } { 2 } # force changed
define_multicycle_path -from { c:FCLK } -through { n:chiptop.chip.porga.CK*TM } -to { c:BBFCLKDS } { 2 }

# set_multicycle_path 2 -setup -from BBFCLK -thr [list socket/BBMA*] -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:39 )
# define_multicycle_path -from { c:BBFCLK } -through { n:chiptop.chip.socket.BBMA* } -to { c:BBFCLKDS } { 2 } # force changed
define_multicycle_path -from { c:FCLK } -through { n:chiptop.chip.socket.BBMA* } -to { c:BBFCLKDS } { 2 }

# set_multicycle_path 1 -hold  -from BBFCLK -thr [list socket/SVPERI*] -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:80 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 1 -hold  -from BBFCLKDS -thr [list dsbbr/PRDTOP*] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:52 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 2 -setup -from BBFCLK -thr [list socket/BBSELSFR2] -to dsbbr/apbctl_prdds_pre_reg_*_/H01 ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:118 )
# define_multicycle_path -from { c:BBFCLK } -through { n:chiptop.chip.socket.BBSELSFR2 } -to { i:chiptop.chip.dsbbr.apbctl_prdds_pre[*] } { 2 } # force changed
define_multicycle_path -from { c:FCLK } -through { n:chiptop.chip.socket.BBSELSFR2 } -to { i:chiptop.chip.dsbbr.apbctl_prdds_pre[*] } { 2 }

# set_multicycle_path 2 -setup -from BBFCLK -thr [list porga/GD*] -thr PADDR* -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:133 )
# define_multicycle_path -from { c:BBFCLK } -through { n:chiptop.chip.porga.GD* } -through { n:chiptop.chip.PADDR* } -to { c:BBFCLKDS } { 2 } # force changed
define_multicycle_path -from { c:FCLK } -through { n:chiptop.chip.porga.GD* } -through { n:chiptop.chip.PADDR* } -to { c:BBFCLKDS } { 2 }

# set_multicycle_path 1 -hold  -from BBFCLK -thr [list socket/BBSELSFR2] -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:42 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 1 -hold  -from BBFCLK -thr [list socket/BBPWRITEOR] -to dsbbr/apbctl_prdds_pre_reg_*_/H01 ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:122 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 2 -setup -from BBFCLK -thr [list socket/BBMA*] -to dsbbr/apbctl_prdds_pre_reg_*_/H01 ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:115 )
# define_multicycle_path -from { c:BBFCLK } -through { n:chiptop.chip.socket.BBMA* } -to { i:chiptop.chip.dsbbr.apbctl_prdds_pre[*] } { 2 } # force changed
define_multicycle_path -from { c:FCLK } -through { n:chiptop.chip.socket.BBMA* } -to { i:chiptop.chip.dsbbr.apbctl_prdds_pre[*] } { 2 }

# set_multicycle_path 2 -setup -thr [list dsbbr/DSPENABLE ] -thr [list socket/BBPRDATA*] ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:28 )
define_multicycle_path -through { n:chiptop.chip.dsbbr.DSPENABLE } -through { n:chiptop.chip.socket.BBPRDATA* } { 2 }

# set_multicycle_path 2 -setup -from BBFCLK -thr [list socket/BBPWRITEOR] -thr [list socket/BBPRDATA*] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:91 )
# define_multicycle_path -from { c:BBFCLK } -through { n:chiptop.chip.socket.BBPWRITEOR } -through { n:chiptop.chip.socket.BBPRDATA* } -to { c:BBFCLK } { 2 } # force changed
define_multicycle_path -from { c:FCLK } -through { n:chiptop.chip.socket.BBPWRITEOR } -through { n:chiptop.chip.socket.BBPRDATA* } -to { c:FCLK } { 2 }

# set_multicycle_path 2 -setup -from BBFCLK -thr [list socket/BBSELSFR2] -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:41 )
# define_multicycle_path -from { c:BBFCLK } -through { n:chiptop.chip.socket.BBSELSFR2 } -to { c:BBFCLKDS } { 2 } # force changed
define_multicycle_path -from { c:FCLK } -through { n:chiptop.chip.socket.BBSELSFR2 } -to { c:BBFCLKDS } { 2 }

# set_multicycle_path 2 -setup -from BBFCLKDS -thr [list port20/TMKBHZ* ] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:62 )
# define_multicycle_path -from { c:BBFCLKDS } -through { n:chiptop.chip.port20.TMKBHZ* } -to { c:BBFCLK } { 2 } # force changed
define_multicycle_path -from { c:BBFCLKDS } -through { n:chiptop.chip.port20.TMKBHZ* } -to { c:FCLK } { 2 }

# set_multicycle_path 1 -hold  -from BBFCLKDS -thr [list dsbbr/PRDTKB*] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:48 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 2 -setup -from BBFCLK -thr [list socket/BBSELSFR2] -thr [list socket/BBPRDATA*] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:88 )
# define_multicycle_path -from { c:BBFCLK } -through { n:chiptop.chip.socket.BBSELSFR2 } -through { n:chiptop.chip.socket.BBPRDATA* } -to { c:BBFCLK } { 2 } # force changed
define_multicycle_path -from { c:FCLK } -through { n:chiptop.chip.socket.BBSELSFR2 } -through { n:chiptop.chip.socket.BBPRDATA* } -to { c:FCLK } { 2 }

# set_multicycle_path 1 -hold  -from [list dsbbr/apbctl_prdds_pre_reg_*_/H02 ] -thr [ list PRDDS* ] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:59 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 2 -setup -from BBFCLK -thr [list socket/BBMA*] -thr [list socket/BBPRDATA*] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:85 )
# define_multicycle_path -from { c:BBFCLK } -through { n:chiptop.chip.socket.BBMA* } -through { n:chiptop.chip.socket.BBPRDATA* } -to { c:BBFCLK } { 2 } # force changed
define_multicycle_path -from { c:FCLK } -through { n:chiptop.chip.socket.BBMA* } -through { n:chiptop.chip.socket.BBPRDATA* } -to { c:FCLK } { 2 }

# set_multicycle_path 1 -hold  -from BBFCLK -thr [list porga/GD*] -thr PWRITE -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:137 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 1 -hold  -from BBFCLKDS -thr [list dsbbr/PRDCMP*] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:54 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 2 -setup -from BBFCLKDS -thr [list dsbbr/PRDTKC*] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:49 )
# define_multicycle_path -from { c:BBFCLKDS } -through { n:chiptop.chip.dsbbr.PRDTKC* } -to { c:BBFCLK } { 2 } # force changed
define_multicycle_path -from { c:BBFCLKDS } -through { n:chiptop.chip.dsbbr.PRDTKC* } -to { c:FCLK } { 2 }

# set_multicycle_path 1 -hold  -from BBFCLK -thr [list socket/BBPWRITEOR] -thr [list socket/BBPRDATA*] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:92 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 1 -hold  -from BBFCLK -thr [list socket/MDWFLRO*] -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:98 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 1 -hold  -from BBFCLK -thr [list porga/CK*TM] -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:128 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 2 -setup -from BBFCLKDS -thr [list dsbbr/PRDTOP*] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:51 )
# define_multicycle_path -from { c:BBFCLKDS } -through { n:chiptop.chip.dsbbr.PRDTOP* } -to { c:BBFCLK } { 2 } # force changed
define_multicycle_path -from { c:BBFCLKDS } -through { n:chiptop.chip.dsbbr.PRDTOP* } -to { c:FCLK } { 2 }

# set_multicycle_path 1 -hold  -from BBFCLK -thr [list socket/BBSELSFR2] -to dsbbr/apbctl_prdds_pre_reg_*_/H01 ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:119 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 1 -hold  -from BBFCLK -thr [list porga/GD*] -thr PSELCMP* -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:140 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 1 -hold  -from BBFCLK -thr [list socket/BBPWRITEOR] -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:44 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 2 -setup -from BBFCLK -thr [list socket/SVPERI*] -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:79 )
# define_multicycle_path -from { c:BBFCLK } -through { n:chiptop.chip.socket.SVPERI* } -to { c:BBFCLKDS } { 2 } # force changed
define_multicycle_path -from { c:FCLK } -through { n:chiptop.chip.socket.SVPERI* } -to { c:BBFCLKDS } { 2 }

# set_multicycle_path 1 -hold  -from BBFCLK -thr [list porga/GD*] -thr PADDR* -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:134 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 2 -setup -from BBFCLK -thr [list socket/BBPWRITEOR] -to dsbbr/apbctl_prdds_pre_reg_*_/H01 ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:121 )
# define_multicycle_path -from { c:BBFCLK } -through { n:chiptop.chip.socket.BBPWRITEOR } -to { i:chiptop.chip.dsbbr.apbctl_prdds_pre[*] } { 2 } # force changed
define_multicycle_path -from { c:FCLK } -through { n:chiptop.chip.socket.BBPWRITEOR } -to { i:chiptop.chip.dsbbr.apbctl_prdds_pre[*] } { 2 }

# set_multicycle_path 2 -setup -from BBFCLK -thr [list porga/GD*] -thr PSELCMP* -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:139 )
# define_multicycle_path -from { c:BBFCLK } -through { n:chiptop.chip.porga.GD* } -through { n:chiptop.chip.PSELCMP* } -to { c:BBFCLKDS } { 2 } # force changed
define_multicycle_path -from { c:FCLK } -through { n:chiptop.chip.porga.GD* } -through { n:chiptop.chip.PSELCMP* } -to { c:BBFCLKDS } { 2 }

# set_multicycle_path 1 -hold -thr [list dsbbr/DSPENABLE ] -thr [list socket/BBPRDATA*] ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:29 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 1 -hold  -from BBFCLKDS -thr [list port20/TMKBHZ* ] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:63 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 1  -setup -fall_from BBFCLK -fall_to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:102 )
# define_clock_delay -fall { c:BBFCLK  } -fall { c:BBFCLKDS } { 29.0 } # force changed
define_clock_delay -fall { c:FCLK  } -fall { c:BBFCLKDS } { 29.0 }

# set_multicycle_path 4 -setup -from BBFCLK -thr [list socket/MDWFLRO*] -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:97 )
# define_multicycle_path -from { c:BBFCLK } -through { n:chiptop.chip.socket.MDWFLRO* } -to { c:BBFCLKDS } { 4 } # force changed
define_multicycle_path -from { c:FCLK } -through { n:chiptop.chip.socket.MDWFLRO* } -to { c:BBFCLKDS } { 4 }

# set_multicycle_path 1 -hold  -from BBFCLK -thr [list socket/BBSELSFR2] -thr [list socket/BBPRDATA*] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:89 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 2 -setup -from BBFCLK -thr [list porga/GD*] -thr PWRITE -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:136 )
# define_multicycle_path -from { c:BBFCLK } -through { n:chiptop.chip.porga.GD* } -through { n:chiptop.chip.PWRITE } -to { c:BBFCLKDS } { 2 } # force changed
define_multicycle_path -from { c:FCLK } -through { n:chiptop.chip.porga.GD* } -through { n:chiptop.chip.PWRITE } -to { c:BBFCLKDS } { 2 }

# set_multicycle_path 1 -hold  -from BBFCLKDS -thr [list dsbbr/PRDTKC*] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:50 )
# Limit Constraint. mksdc cannot convert this constrait now.

# set_multicycle_path 2 -setup -from [list dsbbr/apbctl_prdds_pre_reg_*_/H02 ] -thr [ list PRDDS* ] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:58 )
# define_multicycle_path -from { i:chiptop.chip.dsbbr.apbctl_prdds_pre[*] } -through { n:chiptop.chip.PRDDS* } -to { c:BBFCLK } { 2 } # force changed
define_multicycle_path -from { i:chiptop.chip.dsbbr.apbctl_prdds_pre[*] } -through { n:chiptop.chip.PRDDS* } -to { c:FCLK } { 2 }

# set_multicycle_path 2 -setup -from BBFCLKDS -thr [list dsbbr/PRDTKB*] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:47 )
# define_multicycle_path -from { c:BBFCLKDS } -through { n:chiptop.chip.dsbbr.PRDTKB* } -to { c:BBFCLK } { 2 } # force changed
define_multicycle_path -from { c:BBFCLKDS } -through { n:chiptop.chip.dsbbr.PRDTKB* } -to { c:FCLK } { 2 }





#
#  set_false_path
#


# set_false_path -from [all_clocks] -to [get_clocks BBSCANCLK] ( _device_scr/_plug/d78f2004_clock_plug.scr_101022 L:100 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -from [list socket/dmac/main/dmaack_delay_reg_*_/H02] -through socket/dmac/DMAMA* -through socket/BBSELSFR2OR ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:33 )
# define_false_path -from { i:chiptop.chip.socket.dmac.main.dmaack_delay[*] } -through { n:chiptop.chip.socket.dmac.DMAMA* } -through { n:chiptop.chip.socket.BBSELSFR2OR } # comment out( Customize for ICE )

# set_false_path -from [list socket/dmac/main/dmapr_reg/H02]           -through socket/dmac/DMAMA* -through socket/BBMA* ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:35 )
# define_false_path -from { i:chiptop.chip.socket.dmac.main.dmapr } -through { n:chiptop.chip.socket.dmac.DMAMA* } -through { n:chiptop.chip.socket.BBMA* } # comment out( Customize for ICE )

# set_false_path -from [get_clocks BBSCANCLK2] -to [all_clocks] ( _device_scr/_plug/d78f2004_clock_plug.scr_101022 L:102 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -thr socket/BBCKSTMOR -thr dsbbr/PLLSTOP ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:108 )
define_false_path -through { n:chiptop.chip.socket.BBCKSTMOR } -through { n:chiptop.chip.dsbbr.PLLSTOP }

# set_false_path -from [all_clocks] -to [get_clocks BBSCANCLK2] ( _device_scr/_plug/d78f2004_clock_plug.scr_101022 L:103 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -setup -thr port20_iobuf*/iobuf*/DIN* ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:34 )
define_false_path -through { n:chiptop.chip.port20_iobuf*.iobuf*.DIN* }

# set_false_path -thr socket/BBCKSTROR -thr dsbbr/PLLSTOP ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:107 )
define_false_path -through { n:chiptop.chip.socket.BBCKSTROR } -through { n:chiptop.chip.dsbbr.PLLSTOP }

# set_false_path -from [all_clocks] -to [all_clocks] ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:10 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -from [all_inputs] ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:23 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -from [get_clocks BBSCANCLK] -to [all_clocks] ( _device_scr/_plug/d78f2004_clock_plug.scr_101022 L:99 )
# Removed because of tool limitation or removed macro on ICE

# set_false_path -from [list socket/dmac/main/dmaack_delay_reg_*_/H02] -through socket/dmac/DMAMA* -through socket/BBMA* ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:32 )
# define_false_path -from { i:chiptop.chip.socket.dmac.main.dmaack_delay[*] } -through { n:chiptop.chip.socket.dmac.DMAMA* } -through { n:chiptop.chip.socket.BBMA* } # comment out( Customize for ICE )

# set_false_path -from [list socket/dmac/main/sfr/drs*_reg/H02]        -through socket/dmac/DMAMA* -through socket/BBMA* ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:34 )
# define_false_path -from { i:chiptop.chip.socket.dmac.main.sfr.drs* } -through { n:chiptop.chip.socket.dmac.DMAMA* } -through { n:chiptop.chip.socket.BBMA* } # comment out( Customize for ICE )




#
#  Unrecognized Attribute List
#

# define_attribute { n:chiptop.chip.socket.csc.cg.hioscctl.fmain_sel.cksel_fmain_p.clk1_p } syn_keep { 1 } ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:5)
# define_attribute { n:chiptop.chip.socket.csc.cg.hioscctl.fmain_sel.cksel_fmain_p.clk2_p } syn_keep { 1 } ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:6)
# define_false_path -from {i:chiptop.chip.socket.csc.cg.hioscctl.fmain_sel.cksel_fmain_p.ckmsk2} ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:15)
# define_false_path -from {i:ice.emem.rom.icewr_start_latch} ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:20)
# define_false_path -from {i:ice.emem.rom.ice_write_latch} ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:21)
# define_false_path -from {i:chiptop.chip.socket.csc.cg.hioscctl.fmain_sel.cksel_fmx.ckmsk2} ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:14)
# define_false_path -from {i:chiptop.chip.socket.csc.cg.hioscctl.fmain_sel.cksel_fih_p2.ckmsk2} ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:13)


#
#  UnAnalized Attribute List
#

# set_disable_timing [get_pins  pllctl/pllc/scanclk_mux/clk_gate0/H01] ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:98)
# set_disable_timing [get_pins  tmkbopa0/core/fch0/foctl2/U17/H02] ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:101)
# set_disable_timing [get_pins  tmkbopa2/core/fch0/foctl2/U17/H02] ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:111)
# set_disable_timing [get_pins  tmkbopa2/core/fch0/foctl1/U17/H02] ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:110)
# set_disable_timing [get_pins  tmkbopa1/core/fch1/foctl1/U17/H02] ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:107)
# set_disable_timing [get_pins  tmkbopa2/core/fch1/foctl2/U17/H02] ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:113)
# set_disable_timing [list intm4/EGIN*] ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:38)
# set_disable_timing [get_pins  cg/clksel/clk_gate0/H01] ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:95)
# set_disable_timing [get_pins  tmkbopa0/core/fch0/foctl1/U17/H02] ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:100)
# set_disable_timing [get_pins  tmkbopa1/core/fch0/foctl2/U17/H02] ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:106)
# set_disable_timing [get_pins  tmkbopa0/core/fch1/foctl2/U17/H02] ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:103)
# set_disable_timing [get_pins  tmkbopa1/core/fch1/foctl2/U17/H02] ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:108)
# set_disable_timing [get_pins  tmkbopa1/core/fch0/foctl1/U17/H02] ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:105)
# set_disable_timing [get_pins  tmkbopa0/core/fch1/foctl1/U17/H02] ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:102)
# set_disable_timing [get_pins  tmkbopa2/core/fch1/foctl1/U17/H02] ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:112)


#
#  UnConverted Attribute List
#

# set_min_delay  0 -from socket/BBPWRITEOR  -to socket/BBPRDATA* ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:90)
# set_min_delay  0 -from socket/BBMA*       -to socket/BBPRDATA* ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:88)
# set_min_delay  0 -from socket/BBPENABLEOR -to socket/BBPRDATA* ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:91)
# set_min_delay  0 -from socket/BBSELSFR2OR -to socket/BBPRDATA* ( _device_scr/_plug/d78f2004_chip_plug.scr_101116 L:89)
# set_multicycle_path 1 -hold  -from BBFCLK -thr [list socket/BBMA*] -thr [list socket/BBPRDATA*] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:86)
# set_multicycle_path 1 -hold  -from BBFCLK -thr [list socket/BBMA*] -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:40)
# set_multicycle_path 1 -hold  -from BBFCLK -thr [list socket/BBMA*] -to dsbbr/apbctl_prdds_pre_reg_*_/H01 ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:116)
# set_multicycle_path 1 -hold  -from BBFCLK -thr [list socket/SVPERI*] -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:80)
# set_multicycle_path 1 -hold  -from BBFCLKDS -thr [list dsbbr/PRDTOP*] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:52)
# set_multicycle_path 1 -hold  -from BBFCLK -thr [list socket/BBSELSFR2] -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:42)
# set_multicycle_path 1 -hold  -from BBFCLK -thr [list socket/BBPWRITEOR] -to dsbbr/apbctl_prdds_pre_reg_*_/H01 ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:122)
# set_multicycle_path 1 -hold  -from BBFCLKDS -thr [list dsbbr/PRDTKB*] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:48)
# set_multicycle_path 1 -hold  -from [list dsbbr/apbctl_prdds_pre_reg_*_/H02 ] -thr [ list PRDDS* ] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:59)
# set_multicycle_path 1 -hold  -from BBFCLK -thr [list porga/GD*] -thr PWRITE -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:137)
# set_multicycle_path 1 -hold  -from BBFCLKDS -thr [list dsbbr/PRDCMP*] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:54)
# set_multicycle_path 1 -hold  -from BBFCLK -thr [list socket/BBPWRITEOR] -thr [list socket/BBPRDATA*] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:92)
# set_multicycle_path 1 -hold  -from BBFCLK -thr [list socket/MDWFLRO*] -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:98)
# set_multicycle_path 1 -hold  -from BBFCLK -thr [list porga/CK*TM] -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:128)
# set_multicycle_path 1 -hold  -from BBFCLK -thr [list socket/BBSELSFR2] -to dsbbr/apbctl_prdds_pre_reg_*_/H01 ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:119)
# set_multicycle_path 1 -hold  -from BBFCLK -thr [list porga/GD*] -thr PSELCMP* -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:140)
# set_multicycle_path 1 -hold  -from BBFCLK -thr [list socket/BBPWRITEOR] -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:44)
# set_multicycle_path 1 -hold  -from BBFCLK -thr [list porga/GD*] -thr PADDR* -to BBFCLKDS ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:134)
# set_multicycle_path 1 -hold -thr [list dsbbr/DSPENABLE ] -thr [list socket/BBPRDATA*] ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:29)
# set_multicycle_path 1 -hold  -from BBFCLKDS -thr [list port20/TMKBHZ* ] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:63)
# set_multicycle_path 1 -hold  -from BBFCLK -thr [list socket/BBSELSFR2] -thr [list socket/BBPRDATA*] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:89)
# set_multicycle_path 1 -hold  -from BBFCLKDS -thr [list dsbbr/PRDTKC*] -to BBFCLK ( _device_scr/_plug/d78f2004_chip_add_sta_64m_plus.scr L:50)
